Repository: Libertasio/www.xfce.org
Catalog: lib/po/*.po
Languages: sk

source: Related Sites
sk: Súvisiace stránky

source: Projects
sk: Projekty

source: The Xfce project contains several separated projects for each part of the desktop. Every project has it's own project page to provide additionnal information.
sk: Projekt Xfce obsahuje niekoľko oddelených projektov pre každú časť plochy. Každý projekt má svoju vlastnú stránku projektu k poskytnutiu dodatočných informácií.

source: Core Components
sk: Základné komponenty

source: Window Manager
sk: Správca okien

source: It manages the placement of application windows on the screen, provides window decorations and manages workspaces or virtual desktops.
sk: Riadi umiestnenie okien aplikácie na obrazovke, ponúka dekoráciu okien a riadi pracovné alebo virtuálne plochy.

source: The panel is a bar which allows you to have at all times program launchers, panel menus, a clock, a desktop switcher and more.
sk: Panel je lišta, ktorá vám umožní mať po celú dobu spúšťače programov, panel ponúk, hodiny, prepínač plôch a ďalšie.

source: Desktop Manager
sk: Správca plochy

source: This program sets the background image and provides a root window menu, desktop icons or minimized icons and a windows list.
sk: Tento program nastaví obrázok na pozadí a poskytne ponuku hlavného okna, ikony na ploche alebo minimalizované ikony a zoznam okien.

source: Session Manager
sk: Správca sedenia

source: The session manager controls all aspects of the startup and the shutdown of the user session.
sk: Správca sedenia riadi všetky aspekty spustenia a ukončenia sedenia používateľa.

source: Settings Manager
sk: Správca nastavení

source: It allows you to configure every detail of your desktop environment.
sk: To vám umožní nastaviť každý detail vášho pracovného prostredia.

source: Application Finder
sk: Vyhľadávač aplikácií

source: Allows you to search, launch and find information about applications installed on your system.
sk: Umožňuje vyhľadávať, spúšťať a nájsť informácie o nainštalovaných aplikáciách vo vašom systéme.

source: Xfce Libraries
sk: Xfce knižnice

source: They provide additional functions and widgets which ease the development of applications.
sk: Poskytujú ďalšie funkcie a pomôcky, ktoré uľahčujú vývoj aplikácií.

source: Simple client-server configuration storage and query system.
sk: Jednoduché úložisko a vyhľadávací systém nastavení s architektúrou klient-server.

source: Thunar File Manager
sk: Thunar správca súborov

source: Thunar is a new modern file manager designed from the ground up to be fast and easy-to-use.
sk: Thunar je nový moderný správca súborov, od základov navrhnutý tak, aby bol rýchly a ľahko použiteľný.

source: Applications
sk: Aplikácie

source: Web Browser
sk: Webový prehliadač

source: Midori is a lightweight Web browser.
sk: Midori je jednoduchý webový prehliadač.

source: Terminal is a modern terminal emulator featuring tabs and transparent backgrounds.
sk: Terminál je moderný emulátor terminálu podporujúci záložky a priehľadné pozadie.

source: Xfburn is an application to create and burn CD's and DVD's.
sk: Xfburn je aplikácia pre vytváranie a napaľovanie CD a DVD.

source: A simple calendar application with reminders.
sk: Jednoduchá aplikácia kalendára s pripomienkami.

source: Mixer
sk: Zmiešavač

source: Allows you to change the volume of the different audio tracks.
sk: Umožňuje zmeniť hlasitosť jednotlivých zvukových stôp.

source: Image Viewer
sk: Prehliadač obrázkov

source: Ristretto is a lightweight image viewer.
sk: Ristretto je jednoduchý prehliadač obrázkov.

source: Xfce Desktop Environment
sk: Pracovné prostredie Xfce

source: Categories
sk: Kategórie

source: Home
sk: Domov

source: About
sk: O Xfce

source: Download
sk: Stiahnuť

source: Community
sk: Spoločenstvo

source: Get Involved
sk: Zapojte sa

source: Change language
sk: Zmeniť jazyk

source: Copyright %s <a href="/about/credits">Xfce Development Team</a>. This page was last modified on %s.
sk: Copyright %s <a href="/about/credits">Xfce vývojový tím</a>. Stránka bola naposledy upravená %s.

source: Xfce is a lightweight desktop environment for UNIX-like operating systems. It aims to be fast and low on system resources, while still being visually appealing and user friendly.
sk: Xfce je ľahké pracovné prostredie pre unixové operačné systémy. Jeho cieľom je rýchlosť a nízke nároky na systémové prostriedky, pričom sa stále snaží byť vizuálne príťažlivé a používateľsky prívetivé.

source: Screenshots
sk: Ukážky

source: Xfce %s released
sk: Xfce %s vydané

source: Page not found
sk: Stránka nebola nájdená

source: We're sorry, the page or file you requested was not found on this server.
sk: Je nám ľúto, požadovaná stránka alebo súbor nebola na servery nájdená.

source: If you clicked on a link that brought you to this page, or you have reached this page through a search engine or bookmark, it could very well be that the page you were looking for was removed, renamed or temporary unavailable.
sk: Ak ste klikli na odkaz, ktorý vás priviedol na túto stránku, alebo ste sa na túto stránku dostali prostredníctvom vyhľadávača alebo záložky, mohlo by to byť veľmi dobre, ale stránka, ktorú hľadáte bola odstránená, premenovaná alebo dočasne nie je k dispozícii.

source: Please try one of the following methods to find the page you are looking for:
sk: Prosím vyskúšajte jednu z nasledovných metód pre nájdenie stránky, ktorú hľadáte:

source: If you typed the page address in the Address bar, make sure that it is spelled correctly.
sk: Ak ste adresu stránky zadali do panelu pre adresu, skontrolujte či je zadaná správne.

source: Open the <a href="/">Xfce home page</a> and look for links to the information you want.
sk: Otvorte <a href="/">Xfce Domovskú stránku</a> a nájdite odkazy pre informácie, ktoré chcete.

source: Click the Back button to try another link.
sk: Kliknite na tlačidlo Späť a skúste iný odkaz.

source: You can always <a href="mailto:webmaster@xfce.org">ask the webmaster</a> to assist you with your search, or report the problem in case you think this is needed.
sk: Vždy sa môžete spýtať <a href="mailto:webmaster@xfce.org">webmastera</a>, ktorý vám pomôže v hľadaní, alebo v prípade nutnosti môžete nahlásiť problém.

source: Changelogs
sk: Logy zmien

source: Stable release %s
sk: Stabilná verzia %s

source: Xfce %s is the most recent version of the Xfce desktop environment. You can find the changes in this release <a href="/download/changelogs/%s">here</a>.
sk: Xfce %s je najnovšia verzia pracovného prostredia Xfce. Zmeny v tejto verzii nájdete <a href="/download/changelogs/%s">tu</a>.

source: Individual releases
sk: Jednotlivé verzie

source: Each package in Xfce can make individual stable or development releases, including the core packages (as described in the <a href="/about/releasemodel">release model</a>). You can follow the announcements of the releases on the <a href="/community/lists">Xfce users mailing list</a>, watch the <a href="http://archive.xfce.org/feeds/project/">release feeds</a> or follow the Xfce <a href="http://identi.ca/xfce">identi.ca channel</a>.
sk: Každý balíček v Xfce môže vytvoriť jednotlivo stabilné alebo vývojové vydanie, vrátane základných balíčkov (ako je opísané v <a href="/about/releasemodel">modely vydaní</a>). Nové správy môžete sledovať v <a href="/community/lists">Xfce používateľskej e-mailovej konferencii</a>, taktiež sa pozrite na <a href="http://archive.xfce.org/feeds/projects/">kanály vydania</a>, alebo sledujte Xfce <a href="http://identi.ca/xfce">identi.ca kanál</a>.

source: Preview release %s
sk: Predbežná verzia %s

source: Xfce %s is the latest development release of the Xfce desktop environment. This release should not be used in a production environments. If you are uncertain about downloading this release, you should probably use the <a href="#stable">stable release</a> above. You can find the changes in this release <a href="/download/changelogs/%s">here</a>.
sk: Xfce %s je najnovšie vývojové vydanie pracovného prostredia Xfce. Táto verzia by nemal byť používaný v produkčných prostrediach. Ak si nie ste istí o stiahnutí tejto verzie, asi by ste mali použiť <a href="#stable">stabilnú verziu</a>. Zmeny v tejto verzii môžete nájsť <a href="/download/changelogs/%s">tu</a>.

source: Distributions
sk: Distribúcie

source: Xfce release notes are specific to each version. Select your version from the list below to see the changes in the release.
sk: Xfce poznámky vydania sú špecifické pre každú verziu. Vyberte si verziu z nižšie uvedeného zoznamu pre zistenie zmenien vo vydaní.

source: News
sk: Novinky

source: Credits
sk: Tvorcovia

source: Release Model
sk: Model uvoľňovania

source: In the past the same questions and discussions have come up over and over again whenever a new release was in sight, like:
sk: V minulosti tu boli rovnaké otázky a diskusie, odkedy bola nová verzia v dohľade:

source: What are the core components of Xfce?
sk: Aké sú hlavné komponenty Xfce?

source: How often do we want to release and in what fashion (time-based, feature-based)?
sk: Ako často chceme vydávať a v akom móde (založené na čase, na hlavných verziách)?

source: Who's in charge of the release process?
sk: Kto je zodpovedný za proces vydávania?

source: What dependency versions do we depend on?
sk: Na akých akých verziách závislostí sme závislí?

source: When are feature-freeze, string-freeze, code-freeze and thelike?
sk: Kedy sú hlavné zmrazenia, reťazcové zmrazenia, kódové zmrazenia a podobne?

source: How many pre-releases should we do and how do we call them?
sk: Koľko pre-vydaní by sme mali spraviť a ako by sme ich mali volať?

source: What do we use as a replacement for SVN revision versioning with Git?
sk: Čo môžeme použiť ako náhradu pre SVN správu verzií s Git?

source: This document intends to answer these questions and aims at defining a policy that we can refer to when planning releases.
sk: Tento dokument má v úmysle odpovedať na tieto otázky a jej cieľom je definovať politiku, na ktorú môžeme odkazovať pri plánovaní vydaní.

source: The Xfce Core Desktop
sk: Xfce Desktop jadro

source: All core components of the Xfce desktop must adhere to the release policy defined in this document.
sk: Všetky hlavné komponenty Xfce musí dodržiavať pravidlá zverejňovania definované v tomto dokumente.

source: Essential Dependencies
sk: Zásadné závislostí

source: The Release Cycle
sk: Cyklus vydávania

source: The release cycle involves a short planning phase, a development phase with development releases and a release phase, eventually leading to a new stable release of the entire Xfce core desktop. In parallel to these phases, a maintenance process of the current stable release will continue. During this phase, bugfix releases and security fixes will be released for the stable version of Xfce.
sk: Vývojový cyklus zahŕňa krátku fáze plánovania, fázu vývoja s vývojovými vydaniami a fáza uvoľnenia, ktorá nakoniec vedie k novej stabilnej verzie Xfce. Súbežne sa s týmito fázami sa udržuje proces aktuálnosti stabilnej verzie. V priebehu tejto fázy sú vydané a opravy chýb a zabezpečenia stabilnej verzie Xfce.

source: Below you can see a graphical timeline of an example release cycle and maintenance process for Xfce 4.8 with three components: Thunar, exo and xfwm4.
sk: Nižšie si môžete prezrieť grafickú časovú osi cyklu, napríklad uvoľnenie a údržbu procesu Xfce 4.8 s tromi kompnentami: Thunar, exo a xfwm4.

source: Example Release Cycle
sk: Príklad cyklu vydávania

source: Planning Phase (2(+2) Weeks)
sk: Fáza plánovania (2 (+2) Týždne)

source: This phase marks the beginning of the release cycle and is used to decide which dependencies to use and also to appoint the release team for the cycle (first 2 weeks). It eventually leads to the dependency freeze (after 4 weeks).
sk: Táto fáza predstavuje začiatok cyklu uvoľňovania a používa sa k rozhodnutiu, ktoré závislosti sa použijú a tiež k vymenovaniu tímu pre cyklus (prvé 2 týždne). Nakoniec vedie k zmrazeniu závislostí (po 4 týždňoch).

source: Appointing the Release Team
sk: Venovanie Tímu vydania

source: At the beginning of the planning phase there is a (formal or informal) voting for the release team. The release team supervises development and maintenance releases during the release cycle. Its main purpose is to perform and double-check the Xfce core desktop releases in the release phase at the very end of the cycle. This is explained in more detail in the Release Team section of this document.
sk: Na začiatku plánovania fázy je (formálne alebo neformálne) hlasovanie tímu. Tím dohliada na rozvoj a údržbu počas vývojového cyklu. Jeho hlavným cieľom je realizovať kontroly Xfce jadra až na samom konci cyklu. Toto podrobnejšie vysvetľuje sekcia tímu vydania.

source: Release Team
sk: Tím vydania

source: The release team consists of at least two people: one release manager who can be assisted by others to actually perform the release (tagging, creation of tarballs, writing release notes and announcements) and another person for quality assurance (checking if all components compile, tags are in place, release notes are up to date and so on). This is defined in more detail below.
sk: Vydanie tím sa skladá z najmenej dvoch ľudia: jeden je manažér vydania, ktorý môže pomáhať ostatným k vykonaniu vydania (značenie, vytváranie balíčkov, písanie dokumentu a oznámenia), a ďalšia osoba zabezpečuje kvalitu (kontroluje či sú zostavené všetky komponenty, tagy na mieste, aktuálne poznámky vydania a tak ďalej). Toto je viacej detailne definované nižšie.

source: These are the release team roles and their responsibilities:
sk: Toto sú role tímu vydania a ich zodpovednosť:

source: Release Manager
sk: Manažér vydania

source: Organization of the release cycle
sk: Organizácia cyklu vydania

source: Announce deadlines to developers and translators (repeatedly and early enough)
sk: Oznamovanie termínov vývojárom a prekladateľom (opakovane a včas)

source: Overseeing of maintainance and development releases
sk: Dohliadanie nad údržbou a vývojovými vydaniami

source: Tagging of Xfce-X.Ypre1, Xfce-X.Y.pre2, Xfce-X.Y.pre3 and Xfce-X.Y
sk: Štítkovanie Xfce-X.Y.pre1, Xfce-X.Y.pre2, Xfce-X.Y.pre3 a Xfce-X.Y.

source: Generate tarballs from tags (possibly automated)
sk: Generovanie balíčkov zo štítkov (možno automatizovaná)

source: Write release notes
sk: Napísanie poznámok k vydaniu

source: Write release announcements
sk: Napísať oznámenie o vydaní

source: Create Bugzilla tags
sk: Vytvorenie Bugzilla štítkov

source: Approve fixes of blocker bugs during code freeze
sk: Schvaľuje opravy chýb počas zmrazenia kódu

source: Release Assistant(s)
sk: Asistent(i) vydania

source: Update the website(s)
sk: Aktualizácia webstránky

source: Help the release manager with his tasks
sk: Pomoc manažéra vydania s jeho úlohami

source: Have an eye on libtool versions of maintanance and development releases
sk: Majú pod dohľadom libtool verzie údržby a vývoj vydaní

source: Remind maintainers about missing NEWS updates
sk: Pripomenutie správcom nové chýbajúce aktualizácie

source: Double-check the generated tarballs
sk: Prekontrolovanie vygenerovaných balíčkov

source: Proof-read release announcements
sk: Skorigovanie ohlásenia nového vydania

source: Individual Maintainers
sk: Individuálny správcovia

source: Create component-specific tags for their maintainance and development releases
sk: Vytvorenie špecificky komponentných štítkov pre ich údržbu a rozvoj vydaní

source: Generate tarballs for their maintainance and development releases
sk: Generovanie balíčkov pre ich údržbu a rozvoj vydaní

source: Write ChangeLogs and update NEWS files
sk: Zápis ChangeLogov a aktualizácia nových súborov

source: Write component-specific release announcements
sk: Napísanie špecifických súčastí o novej verzii

source: Create Bugzilla tags for their releases
sk: Vytvorenie Bugzilla tagov pre vydania

source: Make sure API documentation is up to date
sk: Presvedčte sa, že API dokumentácia je aktuálna

source: Dependency Freeze
sk: Zmrazenie závislostí

source: During the first 2 weeks of the planning phase each maintainer is required to
sk: Počas prvých 2 týždňov fázy plánovania je každý správca povinný

source: List the features he wants to implement in the release cycle
sk: Zoznam funkcií realizovaných vo vývojovom cykle

source: Investigate which dependencies are implied by that
sk: Zistenie závislostí, ktoré sú implikované

source: At the end of this, a decision is made on which dependencies the next stable release of the Xfce core desktop will depend. In particular this includes the minimum required versions for all essential dependencies of the Xfce core desktop.
sk: Na konci tohto, je rozhodnuté, na akých závislostiach bude závisieť ďalšie stabilná verzia jadra Xfce. Zahŕňa to najmä minimálne požadované verzie pre všetky základné závislosti jadra Xfce.

source: Maintainers who were not available during the first 2 weeks of the planning phase have the chance to request dependency changes in the 2 weeks after that.
sk: Správcovia, ktorí neboli k dispozícii počas prvých 2 týždňov plánovacej fázy majú možnosť požiadať o zmeny v závislosti do 2 týždňov po tom.

source: At the end of these 4 weeks, all components enter dependency freeze which means they may not change the dependencies (and their versions) they depend on. Optional dependencies for are still allowed to be added though.
sk: Na konci týchto 4 týždňov, sa všetky komponenty zmrazia, čo znamená, že sa nemôžu meniť závislosti (a ich verzie), na ktorých sú závislé. Voliteľné závislosti stále môžu byť pridané.

source: Informing the Community
sk: Informovanie komunity

source: At the very end of the planning phase, a mail with planned features and dependencies for all components of the Xfce core desktop is sent to the xfce4-dev@xfce.org and xfce@xfce.org mailing lists.
sk: Na samom konci fázy plánovania, je poslaný mail s plánovanými funkciami a závislosťami pre všetky komponenty jadra Xfce na xfce4-dev@xfce.org a xfce@xfce.org e-mailovej konferencie.

source: Development Phase (5 Months)
sk: Vývojová fáza (5 mesiacov)

source: During the development phase every maintainer is free to do maintenance and development releases of his components independently of the rest of Xfce.
sk: Počas vývojovej fázy každý správca robí údržbu a rozvoj vydania jeho komponentov nezávisle na zvyšku Xfce.

source: Development Releases
sk: Vývoj verzií

source: Development releases usually give a feature preview for the next stable release. They must follow the X.Y.Z versioning format, where Y is an odd number (e.g. xfwm4-4.7.3 or thunar-1.3.10).
sk: Vývoja verzia zvyčajne poskytuje náhľady funkcie pre budúcu stabilnú verziu. Musí nasledovať formát verzie X.Y.Z, kde Y je nepárne číslo (napr. xfwm4-4.7.3 alebo thunar-1.3.10).

source: Maintainers are encouraged to do development releases for new features they want to make available to others. Frequent development releases can act as a replacement of the SVN revision versioning we had in the past. If component A depends on a new feature in component B, A may only be released if there is a development release of B shipping this feature. For this to work, libtool versions must be updated properly with every development release.
sk: Správcovia odporúčajú vývoj vydaní pre nové funkcie, ktoré chcú sprístupniť ostatným. Časté vývojové vydania môže slúžiť ako náhrada SVN revízie verzií ako sme mali v minulosti. Ak je komponent A závislý na novej funkcii v komponente B, A môžu byť uvoľnené iba v prípade, že tu je vývoj verzia B. Aby toto fungovalo, musí byť libtool verzia správne aktualizovaná s každou vývojovou verziou.

source: Care has to be taken of the master branch of each component. The master branch should always remain in a release-ready state. New features should be developed in branches until they are ready (as in: compiling and the component will remain functional even after merging the feature(s) into the master branch), to lower the risk of delaying the final release of the entire Xfce core desktop.
sk: Je potrebné venovať pozornosť hlavnej vetve každého komponentu. Hlavný vetva by mala vždy ostať vo verzii pripravenej pre vydanie. Nové funkcie by mali byť vyvinuté vo vetvách, kým nie sú pripravené (ako: Kompilácia a komponent zostanú funkčné aj po zlúčení funkcie/funkcií do hlavnej vetvy), k zníženiu rizika odloženia finálnej verzie jadra Xfce.

source: New features breaking APIs or other core components should be communicated. Maintainers are suggested to prepare other components for these features in a separate branch before including the features in a new development release. That way the other components retain their release-ready state.
sk: Nové funkcie rozhrania API alebo iné základné súčasti by mali byť oznámené. Správcovia navrhujú prípravu ďalších komponentov pre tieto funkcie v samostatnej vetve, vrátane funkcie v novej vývojovej verzii. Tak ostatné komponenty udržané v stave pripravenom pre ich vydanie.

source: This is how the basic development workflow looks like:
sk: To je, ako vyzerá základný vývojový postup:

source: Development Workflow
sk: Vývojový postup

source: Release Phase (10+ Weeks)
sk: Fáza vydaní (10+ Týždňoch)

source: During the release phase, there will be three pre-releases and one final release:
sk: Počas fázy uvoľnenia vydania, budú existovať tri pre-verzie a jedna finálna verzia vydania:

source: Xfce X.Ypre1 (after 0 weeks, feature freeze),
sk: Xfce X.Ypre1 (po 0 týždňoch, hlavné zmrazenie),

source: Xfce X.Ypre2 (after 4 weeks, string freeze) and
sk: Xfce X.Ypre2 (po 4 týždňoch, reťazové zmrazenie) a

source: Xfce X.Ypre3 (after 8 weeks, code freeze)
sk: Xfce X.Ypre3 (po 8 týždňoch, zmrazenie kódu)

source: Xfce X.Y (after 10+ weeks)
sk: Xfce X.Y (po 10+ týždňoch)

source: where Y has to be an even number. Each of these releases has to include the latest development releases of all components (or stable, if there were no development releases since the last stable release) of the Xfce core desktop. The version numbers of these components may (even have to) differ from the naming scheme above. E.g. for Xfce 4.8.0pre2, xfwm4 could have the version 4.7.17 and Thunar could have 1.1.9.
sk: kde Y má byť párne číslo. Každá z týchto vydaní musí zahŕňať najnovšiu vývojovú verziu všetkých komponentov (alebo stabilnú, ak by nebol vývoj od vydania poslednej stabilnej verzie) jadra Xfce. Čísla verzií týchto komponentov sa môže (dokonca musí) líšiť od vyššie uvedenej schémy pomenovania. Napr. pre Xfce 4.8.0pre2, xfwm4 by mal mať verziiu 4.7.17 a Thunar by mohol mať 1.1.9.

source: This means that maintainers don't necessarily have to release new versions of their components along with one of the pre-releases. The release team always picks the latest available development or stable release of each component for pre-releases and the final release.
sk: To znamená, že správcovia nemusia nutne mať vydanie novej verzie ich komponentov spolu s jedným z pre-vydaním. Tím vydania vždy vyberie posledné dostupné vývojové alebo stabilné verzie jednotlivých komponentov pre pre-vydanie a konečné vydanie.

source: The end of this phase marks a new stable release of the Xfce core desktop and therewith the start of a new release cycle.
sk: Koniec tejto fázy značí novú stabilnú verziu jadra Xfce a tým aj začiatok vydania nového cyklu.

source: Freezing before Releases
sk: Zmrazenie pred vydaním

source: There are different freeze types before releases.
sk: Rôzne typy zmrazenia pred vydaním.

source: Feature Freeze
sk: Hlavné Zmrazenie

source: With Xfce X.Ypre1, all core components enter feature freeze which means from there on only translations and bugfixes are allowed to go into the master branch.
sk: U Xfce X.Y.pre1 sa všetky hlavné zložky vložia do hlavného zmrazenia, čo znamená, že len preklady a opravy chýb môžu ísť do hlavnej vetvy.
