Repository: Libertasio/www.xfce.org
Catalog: lib/po/*.po
Languages: sk

source: String/UI Freeze
sk: Reťazec/UI Zmrazenie

source: With Xfce X.Ypre2, all core components enter string/UI freeze which means from there on no strings which affect translations may be changed. Same goes for the user interface which may not be changed after this point.
sk: U Xfce X.Y.pre2 sa všetky hlavné zložky vložia do reťazcového/UI zmrazenia, čo znamená, že v žiaden z reťazcov, ktorý ovplyvňuje preklad nemôže byť zmenený. To isté platí aj pre používateľské rozhranie, ktoré sa nesmie meniť po tomto bode.

source: Code Freeze
sk: Zmrazenie kódu

source: There is a short 2-days code freeze before every pre-release. During this period of time, no commits may be sent unless they are signed off by the release manager.
sk: K dispozícii je krátke 2-dňové zmrazenie kódu pred každým pre-vydaním. Počas tohto obdobia, nie sú uvoľnené, pokiaľ nie sú podpísané manažérom vydania.

source: With Xfce X.Ypre3, all core components enter code freeze which means from there on no code changes are allowed, unless they are signed off by the release manager. These should usually only be fixes to blocking or release-critical bugs. Translations are still allowed to go in.
sk: U Xfce X.Y.pre3 sa všetky hlavné zložky vložia do kódového zmrazenia, čo znamená, že nie sú povolené zmeny žiadneho kódu, pokiaľ nie sú podpísané manažérom vydania. Mali by to byť zvyčajne len opravy zablokovania alebo uvoľnenia kritických chýb. Preklady sú stále povolené.

source: Code Freeze Phase (2+ weeks)
sk: Fáza zmrazenia kódu (2+ týždne)

source: With Xfce X.Ypre3, all core components enter code freeze. This phase is illustrated in the following figure and is explained in more detail in this section.
sk: U Xfce X.Y.pre3 sa všetky hlavné zložky vložia do kódového zmrazenia. Táto fáza je znázornené na nasledujúcom obrázku, a je podrobnejšie vysvetlená v tejto kapitole.

source: The code freeze and its exceptions are supported by commit hooks. There is an update hook which doesn't allow any changes to master unless they are signed off by the release manager.
sk: Zmrazenie kódu a jeho výnimky sú podporované spravením háčika. K dispozícii je update háčik, ktorý neumožňuje žiadne zmeny hlavnej vetvy, pokiaľ nie sú podpísané manažérom vydania.

source: Tagging and Branching for Releases
sk: Značenie a vetvenie verzí

source: Bugfixes/Changes
sk: Opravy / Zmeny

source: If a core component requires fixes or changes during code freeze, the maintainer is required to create a new branch called ELS (//NAME OPEN FOR DISCUSSION//) to which he or she then commits the fixes. Refer to the section Code Freeze Exceptions if these are release-critical changes or fixes for blocking bugs.
sk: Ak základný komponent vyžaduje opravy či zmeny počas zmrazenie kódu, je správca povinný vytvoriť novú vetvu nazvanú ELS (//NAME OPEN FOR DISCUSSION//), ku ktorému sa potom spraví oprava. Viac nájdete v časti Výnimky zmrazenie kódu, ak ide o kritické zmeny alebo opravy pre blokovanie chýb.

source: The ELS branch only lives for a short period of time. It is merged into master and into the component's stable branch (e.g. xfwm4-4.8 or thunar-1.2) after the final release. Only bugfixes are allowed in this branch.
sk: Vetva ELS existuje len na krátku dobu. Je zlúčená do hlavnej vetvy a do komponentov stabilnej vetvy (napr. xfwm4-4.8 alebo Thunar-1.2) po konečnom vydaní. Len opravy chýb sú povolené v tejto vetve.

source: Code Freeze Exceptions
sk: Výnimky zmrazenia kódu

source: Blocking Bugs
sk: Blokovanie bugov

source: Certain bugs may delay the final release if they are considered blockers. This is the case under any of the following circumstances:
sk: Niektoré chyby môžu oneskoriť finálnu verziu, ak sú považované za blokové. To je prípad z niekoľkých nasledujúcich podmienok:

source: it crashes a core application
sk: dôjde k pádu jadra aplikácie

source: it causes data loss
sk: spôsobí to stratu dát

source: it causes an ever-growing memory leak
sk: spôsobí to stále rastúci pamäťový únik

source: it locks the entire desktop GUI
sk: uzamkne to celé GUI

source: A bug may not delay a release if it meets the following criteria:
sk: Chyba nemusí oneskoriť vydanie, ak spĺňa nasledujúce kritériá:

source: the hardware or architecture on which the bug occurs is exotic and/or there's no way for developers to reproduce the bug
sk: hardvér alebo architektúra, na ktorých sa chyba prejavila, je exotická a/alebo neexistuje spôsob ako oznámiť chybu vývojárom

source: Fixes for these bugs are allowed to be applied during code freeze if, and only if they are signed off by the release manager.
sk: Opravy týchto chýb je povolené aplikovať počas zmrazenie kódu, len vtedy, ak sú podpísané manažérom vydania.

source: Release-Critical Changes
sk: Uvoľnenie kritických zmien

source: Some changes may be of big concern with regards to the quality of the release. They are allowed to go in if, and only if they are signed off by the release manager.
sk: Niektoré zmeny môžu mať veľký problém s ohľadom na kvalitu vydania. Sú povolené len vtedy, ak sú podpísaná manažérom vydania.

source: Releasing
sk: Uvoľnenie

source: For the final release (Xfce X.Y), all core components are tagged (twice, once with their own version and once with xfce-X.Y.0) and branched for the maintenance cycle (e.g. as thunar-1.2 or xfwm4-4.8). After that, the ELS branch is merged into master (where the development for the next release takes place) and into e.g. thunar-1.2 or xfwm4-4.8.
sk: Pre finálnu verziu (Xfce X.Y), sú všetky kľúčové komponenty označené (dvakrát, raz s ich vlastnou verziou a raz s xfce-X.Y.0) a rozvetvené pre zachovanie cyklu (napr. thunar-1.2 alebo xfwm4-4.8). Potom je vetva ELS zlúčená do hlavnej (kde je vývoj pre ďalšie vydanie) a do, napr. thunar-1.2 alebo xfwm4-4.8.

source: Maintenance Process
sk: Údržba procesov

source: After the release of a final version, bugfixes and translation updates will be committed to a stable component-specific branch (like thunar-1.2 or xfwm4-4.8). Maintenance releases of individual components are not required to be synchronized.
sk: Po uvoľnení finálnej verzie, opravy chýb a aktualizácii prekladov budú zviazané do stabilnej špecifickej vetvy (ako je thunar-1.2 alebo xfwm4-4.8). Údržba verzií jednotlivých komponentov nemusí byť synchronizovaná.

source: Maintenance Releases
sk: Údržba vydaní

source: There may be no API/ABI changes in maintenance releases compared to the corresponding final release of the Xfce core desktop. They also must follow the X.Y.Z versioning format, where Y is an even number (e.g. xfwm4-4.8.4 or thunar-1.2.4). No new features or strings may be introduced in these releases.
sk: V údržbe vydaní nemusia byť API/ABI zmeny v porovnaní s rovnakou konečnou verziou Xfce jadra. Taktiež je potrebné nasledovať verzie formátu X.Y.Z, kde Y je párne číslo (napr. xfwm4-4.8 alebo thunar-1.2.4). Žiadne nové funkcie a reťazce nemôžu byť zavedené v týchto verziách.

source: Authors
sk: Autori

source: Some screenshots of Xfce, ordered by version.
sk: Ďalšie ukážky Xfce, usporiadané podľa verzií.

source: File Manager
sk: Správca súborov

source: Settings
sk: Nastavenia

source: Remote shares browsing
sk: Prehliadanie vzdialeného zdieľania

source: Thunar now has optional support for GVFS which will allow you to browse remote shares using Thunar: FTP, Windows Shares, WebDav and SSH servers...
sk: Thunar teraz voliteľne podporuje GVFS, ktoré vám umožní prechádzať vzdialené zdieľanie s použitím Thunar: FTP, Windows zdieľania, WebDav a SSH serverov...

source: Thunar browsing a remote share
sk: Thunar prehľadávanie vzdialeného zdieľania

source: New file operations progress dialog
sk: Nové dialógové okno priebehu s operáciami súboru

source: When several file operations (copy or move) are being handled in parallel, Thunar now shows a single progress dialog which displays all the relevant information.
sk: Ak sa s hlavnými operáciami so súbormi (kopírovanie alebo presúvanie) manipuluje paralelne, Thunar ukazuje jedno dialógové okno priebehu, ktoré zobrazuje všetky dôležité informácie.

source: Progress dialog
sk: Dialógové okno priebehu

source: Eject button for removable devices
sk: Tlačidlo vysunutia pre vymeniteľné zariadenia

source: It is is now possible to eject removable devices by clicking the eject button near each removable device label in the side pane.
sk: Teraz je možné vysunúť vymeniteľné zariadenia kliknutím na tlačidlo vysunutia, ktoré je umiestnené blízko každého štítku vymeniteľného zariadenia v bočnom paneli.

source: Eject button
sk: Tlačidlo na vysunutie

source: The Xfce panel has been totally rewritten in 4.8, here are the most visible changes.
sk: Xfce panel bol úplne prepracovaný vo verzii 4.8, a tu sú najviac viditeľné zmeny.

source: Improved positioning and size handling
sk: Vylepšené umiestnenie a manipulácia veľkosti

source: Transparent backgrounds
sk: Priehľadné pozadia

source: The panel is now able to draw transparent panel backgrounds with non transparent items. Your panel items will remain readable and you will enjoy a nice panel look.
sk: Panel je teraz možné vykresliť s priehľadným pozadím bez priehľadných predlôh. Vaše položky panela zostanú naďalej čitateľné a budete mať pekný vzhľad panelu.

source: Transparent panel background
sk: Priehľadné pozadie panela

source: New item editor
sk: Nová položka editoru

source: The panel now features an item editor which allows to modify, move, add and remove items quickly. This is particularly useful for items which are hard to right click and gives you an easy way to change your panel layout from a single place.
sk: Panel je teraz vybavený editorom položiek, ktorý umožňuje rýchlo upravovať, presúvať, pridávať alebo mazať položky. Toto je užitočné najmä pri položkách, na ktoré sa ťažko kliká pravým tlačidlom myši a toto vám dáva jednoduchý spôsob, ako zmeniť rozloženie panela z jedného miesta.

source: Panel item editor
sk: Panel položky editoru

source: Drag and drop to create launchers
sk: "Drag and drop" pre vytvorenie spúšťačov

source: You can now drag and drop menu entries from the panel applications menu, application finder or Thunar to the panel to create launchers. This feature should please the huge number of people who had been requesting it for ages. The launcher also has an integrated application finder to add new items.
sk: Teraz môžete pretiahnuť menu položky z ponuky panelu s aplikáciami. Táto funkcia by mala potešiť veľký počet ľudí, ktorí o to večne žiadali. Spúšťač má tiež integrovaný vyhľadávač aplikácií pre pridávanie nových položiek.

source: Window buttons plugin
sk: Modul tlačidlá okna

source: The iconbox and tasklist plugins are new merged into 1 plugin, called window buttons. It implements different sorting modes, improved handling in vertical panels and can draw a similar frame as Xfwm4 Alt+tab when hovering a button.
sk: Moduly ikon a zoznamu úloh sú spojené do jedného, nazvaného tlačidlá okna. Implementuje rôzne delenie módov, lepšiu manipuláciu vo vertikálnom panely a dokáže vykresliť podobný frame ako Xfwm4 Alt+tab.

source: New fuzzy clock
sk: Nové fuzzy hodiny

source: An Xfce release without a new clock mode would not be a true Xfce release. Let us introduce you the 'fuzzy' clock mode!
sk: Verzia Xfce bez nového režimu hodín nemôže byť označená za správnu verziu. Dovoľte nám, predstaviť Vám "Fuzzy" režim hodín!

source: New fuzzy clock mode
sk: Nový fuzzy režim hodín

source: New directory menu plugin
sk: Nový menu adresár modul

source: The directory menu plugin provides a menu reproducing the arborescence of a particular folder. This allows you to open a terminal or a file manager in a sub-folder in a very fast and efficient way.
sk: Modul ponuky adresára poskytuje stromovité menu konkrétnej zložky. Toto umožní otvoriť terminál alebo správcu súborov v podzložke veľmi rýchlym a efektívnym spôsobom.

source: Directory menu plugin
sk: Menu adresár modul

source: Applications menu edition
sk: Menu aplikácie vydania

source: You can now edit the applications menu using any Freedesktop compliant menu editor, Alacarte being the one we used to test.
sk: Teraz môžete upraviť menu aplikácií pomocou ľubovoľného Freedesktop kompatibilného menu editora, Alacarte bol použitý na testovanie.

source: Improved multihead setup configuration
sk: Vylepšené nastavenie konfigurácie

source: Xfce can now handle and setup multihead setups for any randr 1.2 compatible driver. Unfortunately, this means it will not work with Nvidia proprietary drivers.
sk: Xfce vie teraz zaobchádzať a nastavovať viachlavové nastavenia pre randr 1.2 kompatibilný ovládač. Bohužiaľ, to znamená, že to nebude fungovať s proprietárnymi ovládačmi NVIDIA.

source: You can enable and disable plugged screens, set their resolution, refresh rate, rotation and reflection, clone screens or extend desktops.
sk: Môžete povoliť a zakázať zapojené obrazovky, nastaviť rozlíšenie, obnovovaciu frekvenciu, rotáciu a reflexiu, klonovanie obrazovky alebo rozšírenie pracovnej plochy.

source: New display settings dialog
sk: Nové dialógové okno nastavenia obrazovky

source: Timed confirmation
sk: Dočasné potvrdenie

source: Any change made with the settings dialog will have to be confirmed within ten seconds or they will be reverted. This prevents broken video drivers from leaving your computer unusable.
sk: Akákoľvek zmena vykonaná v dialógovom okne nastavení musí byť potvrdená do desiatich sekúnd alebo zmeny budú vrátené späť. Tým sa zabráni pred nepoužiteľnosťou počítača pri rozbitých ovládačoch grafickej karty.

source: Timed confirmation for display settings changes
sk: Časové potvrdenie pre zmenu nastavení obrazovky

source: Quick setup dialog
sk: Dialóg rýchleho nastavenia

source: The quick setup dialog allows you to configure a dual screen setup in a second. Plug the second screen, press the display key or Windows + p and select the wanted layout. Done!
sk: Rýchle nastavenie dialógu umožňuje nastaviť duálne zobrazenie. Zapojte druhú obrazovku, stlačte display tlačidlo alebo Windows + P a vyberte rozvrhnutie. Hotovo!

source: Quick multihead setup
sk: Rýchle kombinované nastavenie

source: Settings edition in the Xfce Settings Editor
sk: Nastavenie vydania v Xfce Editor Nastavení

source: The Xfce Settings Editor now deserves its name, it is no longer a simpler Xfconf settings viewer. You can now modify, delete, add and reset settings through its interface. It also monitors changes to update its view.
sk: Xfce Editor Nastavení si zaslúži spomenutie, Xfconf je už jednoduchšie nastaviteľný. Teraz môžete meniť, mazať, pridávať a resetovať nastavenia prostredníctvom rozhrania. Toto tiež monitoruje zmeny aktualizácie.

source: Editing Xfconf properties with the Settings Editor
sk: Editácia vlastností Xfconf s Editorom Nastevení

source: Improved keyboard layout selection
sk: Vylepšené rozloženie klávesnice

source: The layout selection dialog received a lot of love: it no longer displays cryptic language/variants codes but uses localized languages/variants names. Layout edition was also made easier by prefilling the dialogs with the current values.
sk: Dialóg výberu rozloženia dostal veľa lásky: už nezobrazuje kryptovaný jazyk / kódové varianty ale lokalizovaný jazyk / mená variantov. Rozloženie bolo tiež spravené jednoduchšie s aktuálnymi hodnotami.

source: Layouts and variants list
sk: Zoznam rozvrhnutia a variantov

source: Changes in this release
sk: Zmeny v tomto vydaní

source: No news articles found.
sk: Žiadne nové články neboli nájdené.

source: Xfce embodies the traditional UNIX philosophy of modularity and re-usability. It consists of a number of components that provide the full functionality one can expect of a modern desktop environment. They are packaged separately and you can pick among the available packages to create the optimal personal working environment.
sk: Xfce stelesňuje tradičnú UNIX filozofiu modularity a opätovného použitia. Skladá sa z niekoľkých prvkov, ktoré poskytujú plnú funkčnosť s možnosťou očakávania moderného pracovného prostredia. Prvky sú v balíčkoch jednotlivo a môžete si vybrať medzi balíčkami ktoré sú k dispozícii pre vytvorenie optimálneho osobného pracovného prostredia.

source: Xfce can be installed on several UNIX platforms. It is known to compile on Linux, NetBSD, FreeBSD, OpenBSD, Solaris, Cygwin and MacOS X, on x86, PPC, Sparc, Alpha...
sk: Xfce môže byť inštalované na rôznych platformách UNIX. Je možná kompilácia na Linux, NetBSD, FreeBSD, OpenBSD, Solaris, MacOS X a Cygwin na x86, PPC, Sparc, Alpha...

source: Features
sk: Vlastnosti

source: Manages the placement of windows on the screen, provides window decorations and manages workspaces or virtual desktops.
sk: Riadi umiestnenia okien na obrazovke, ponúka dekorácie okien a riadi pracovné plochy alebo virtuálne desktopy.

source: Sets the background image and provides a root window menu, desktop icons or minimized icons and a windows list.
sk: Nastavuje obrázok na pozadí a poskytuje superužívateľské menu, ikony na ploche alebo minimalizovanie ikon a zoznam okien.

source: Switch between opened windows, launch applications, switch workspaces and menu plugins to browse applications or directories.
sk: Prepínanie medzi otvorenými oknami, spúšťanie aplikácií, prepínanie pracovných plôch a menu zásuvných modulov pre prezeranie aplikácií a adresárov.

source: Controls the login and power management of the desktop and allows you to store multiple login sessions.
sk: Ovláda prihlasovanie a riadenie spotreby, a umožňuje uložiť viac prihlásených sedení.

source: Provides the basic file management features and unique utilities like the bulk renamer.
sk: Poskytuje základné funkcie pre správu súborov a jedinečné nástroje, ako je hromadné premenovanie.

source: Setting Manager
sk: Správca nastavení

source: Tools to control the various settings of the desktop like keyboard shortcuts, appearance, display settings etcetera.
sk: Nástroje pre správu rôznych nastavení pracovnej plochy, ako klávesové skratky, vzhľad, nastavenie displeja tak ďalej.

source: Beside the basic set of modules, Xfce also provides numerous additional applications and plugins so you can extend your desktop the way you like, for example a terminal emulator, text editor, sound mixer, application finder, image viewer, iCal based calendar and a CD and DVD burning application. You can read more about the modules of Xfce in the <a href="/projects">projects</a> page.
sk: Okrem základnej sady modulov, Xfce taktiež poskytuje radu ďalších aplikácií a zásuvných modulov, takže si môžete pracovnú plochu rozšíriť podľa vášho vkusu rôznymi aplikáciami, ako napríklad: terminál emulátor, textový editor, zvukový mixer, vyhľadávač aplikácií, prehliadač obrázkov, kalendár iCal či aplikáciu pre napaľovanie CD a DVD. Viac o moduloch Xfce si môžete prečítať na <a href="/projects">stránke projektov</a>.

source: Xfce 4.6 tour
sk: Xfce 4.6 prehliadka

source: The long awaited 4.6.0 version of the Xfce Desktop Environment is finally available. We will try to highlight some of the new features which have been added since the last stable release.
sk: Dlho očakávaná verzia 4.6.0 prostredie Xfce je konečne k dispozícii. Budeme sa snažiť ukázať niektoré z nových funkcií, ktoré boli pridané od poslednej stabilnej verzie.

source: Since desktop icons have been introduced in Xfce 4.4, people have expressed the need to allow the selection of multiple icons (rubber banding). With <b>Xfce 4.6</b>, the <b>Xfdesktop</b> manager finally implements this feature: you can select multiple icons, remove them, etcetera...
sk: Vzhľadom k tomu, že ikony na ploche boli zavedené v Xfce 4.4, ľudia vyjadrili, že je potrebné, aby bolo možné vybrať z viaceré ikony. S <b>Xfce 4.6</b>, <b>Xfdesktop</b> manažér konečne implementuje túto funkciu: môžete si vybrať viac ikon, odstrániť ich a tak ďalej...

source: Multiple icons selection
sk: Výber viacerých ikon

source: <b>Xfce 4.6</b> features a brand new desktop menu which allows you to manipulate files as with the <b>Thunar</b> filemanager contextual menu, but also to open applications, exit your session, or access the help documentation.
sk: <b>Xfce 4.6</b> má úplné nové menu plochy, ktoré umožňuje manipulovať so súbormi ako kontextové menu v <b> Thunare</b>, ale aj otvárať aplikácie, ukončenie sedenia či pristupovať k dokumentácii.

source: New desktop menu
sk: Nové menu plochy

source: A lot of long standing bugs have been fixed in <b>Xfce4 Panel</b>, particularly for multiple screen setups, but this new release also brings an improved set of panel plugins.
sk: Veľa dlhodobých chýb bolo opravených v <b>paneli Xfce4</b>, a to najmä pre nastavenie viac obrazoviek, ale nová verzia taktiež prináša vylepšenú sadu modulov pre panel.

source: New binary clock
sk: Nové binárne hodiny

source: The <b>clock plugin</b> has been rewritten to consume fewer system resources and to fix some display bugs, but there is also a new clock mode for the geek in you: binary clock! The new <b>notification area plugin</b> allows you to hide selected notification icons to keep your notification area clean and readable.
sk: <b>Modul hodín</b> bol prepísaný tak, aby spotreboval menej systémových prostriedkov a tiež boli opravené niektoré chyby zobrazenia, ale je tam aj nový režim hodín pre geekov: binárne hodiny! Nová <b>plugin oznamovacej oblasti</b> umožňuje skryť vybrané ikony v oznamovacej oblasti tak, aby bola vaša oznamovacia oblasť čistá a čitateľná.

source: <b>Xfce4 Mixer</b> has been rewritten from scratch to use <a href="http://www.gstreamer.net/">Gstreamer</a>. This allows us to more easily support multiple sound systems, the user interface is more polished, and you can manage several different sound cards. Additionally, a panel plugin allows you to set the system sound quickly using the mouse scroll wheel.
sk: <b>Xfce4 Mixer</b> bol od základu prepísaný k použitiu <a href="http://www.gstreamer.net/">GStreamer</a>. Toto nám umožňuje lepšie podporovať viacero zvukových systémov, používateľské rozhranie je uhladenejšie a je možné spravovať niekoľko rôznych zvukových kariet. Ďalej panel modulov umožňuje nastaviť systém zvuku rýchlejšie pomocou kolieska na myške.

source: New sound mixer
sk: Nový zvukový zmiešavač

source: <b>Xfce 4.6</b> comes with an enhanced session manager: your session should be started faster, and the settings dialog has been reworked to ease the management of session-aware applications. Additionally, the session manager will now automatically restart session applications which crashed so that you are not left without a desktop, panel, window manager, etcetera, if a crash occurs.
sk: <b>Xfce 4.6</b> prichádza s rozšíreným Manažérom sedenia: vaše sedenie by sa malo štartovať rýchlejšie a taktiež bolo prepracované nastavenie dialógu pre uľahčenie riadenia sedenia aplikácií. Okrem toho bude Manažér sedenia teraz automaticky reštartovať sedenia aplikácií, ktoré havarovali, tak že neopustíte plochu, panel, správcu okien a podobne, ak dôjde k ich chybe.

source: Session settings dialog
sk: Dialógové okno nastavenia sedenia

source: The session manager also includes a new long-awaited feature: support for <b>suspend</b> and <b>hibernate</b> "out of the box." The logout dialog now has two additional buttons which offer to suspend or hibernate your computer.
sk: Manažér sedenia ďalej obsahuje nové dlho očakávané funkcie: podpora <b>pozastavenia</b> a <b>hibernácie</b>. Dialóg odhlásenia má teraz dve ďalšie tlačidlá, ktoré ponúkajú režim spánku počítača alebo hibernácie.

source: Session logout dialog
sk: Dialógové okno odhlásenia sedenia
