Repository: Libertasio/www.xfce.org
Catalog: lib/po/*.po
Languages: sk

source: By becoming a developer, you can make a big difference while enjoying a challenging and fun experience. You'll learn to be a better coder, you will get to implement new features and defeat daunting bugs, creating a stunning product, all the while collaborating with people from all around the world.
sk: Tým, že sa stanete vývojárom, môžete mať veľký vplyv a zároveň si užívať náročnú či zábavnú skúsenosť. Naučíte sa byť lepším kóderom, budete implementovať nové funkcie a porážať chyby, vytvárať ohromujúci produkt a celú dobu budete spolupracovať s ľuďmi z celého sveta.

source: Promotion
sk: Reklama

source: If you own a blog or website you can greatly help by spreading the word and encouraging new users to give Xfce a try. If you have a Identi.ca or Twitter account you can also help by reposting any <a href="http://identi.ca/xfce">announcements</a> we make to help us reach a larger audience.
sk: Ak máte vlastný blog alebo webové stránky, môžete výrazne pomôcť tým, že budete rozširovať aby nový používatelia vyskúšali Xfce prostredie. Ak máte Identi.ca alebo Twitter účet, môžete tiež pomôcť tým, že spravíte <a href="http://identi.ca/xfce">oznámenia</a>, aby ste nám pomohli osloviť širšie publikum používateľov.

source: Bug Reporting and testing
sk: Hlásenie chýb a testovanie

source: One of the most useful tasks that we rely on the community for is testing and reporting of bugs. Since Xfce runs on various platform and in a lot of different setups, testing all changes in every possible situation is an impossible task. As such we kindly ask users to assist in testing, and reporting all bugs they may find, using our <a href="https://bugzilla.xfce.org" class="external">bug tracker</a>.
sk: Jednou z najužitočnejších úloh, s ktorou sa budeme spoliehať na komunitu, je testovanie a hlásenie chýb. Vzhľadom k tomu, že Xfce beží na rôznych platformách, a v mnohých rôznych nastaveniach, testovanie všetkých zmien v akejkoľvek možnej situácii je nesplniteľná úloha. Preto žiadame používateľov, aby pomohli pri testovaní a hlásení všetkých chýb ktoré našli pomocou našej aplikácie na <a href="https://bugzilla.xfce.org" class="external">sledovanie chýb</a>.

source: Once a bug has been found, the cause of the bug needs to be tracked down, and then (obviously) fixed. If you want to get involved in the actual development process of Xfce a great way to start is by solving bugs and then submitting a patch file.
sk: Akonáhle je nájdená chyba, musí byť chyba nahlásená, a potom (samozrejme) opravená. Ak sa chcete zapojiť do skutočného procesu vývoja Xfce, skvelým spôsobom ako začať je riešenie opravy chýb a predkladanie opravných súborov.

source: Xfce uses the <a href="http://transifex.org">Transifex</a> translation platform as a portal for translators. This allows translators to translate on-line, submit new <em>po</em>-files, watch translations and view statistics. All translation updates are directly submitted in the <a href="http://git.xfce.org">Xfce GIT repositories</a>, so they are directly available for the rest of the world.
sk: Xfce používa <a href="http://transifex.org">Transifex</a> prekladovú platformu ako portál pre prekladateľov. Toto umožňuje prekladateľom prekladať on-line, predkladať nové <em>po</em> súbory, sledovať preklady a prezerať štatistiky. Všetky aktualizácie prekladov sú predložené priamo v <a href="http://git.xfce.org">GIT Xfce repozitároch</a>, takže sú vždy priamo k dispozícii.

source: Because we'd like to translate Xfce in as much languages as possible, we are always looking for new translation contributors. If you're interested in this, read the <em>getting started</em> section below.
sk: Pretože chceme preložiť Xfce do množstva jazykov, ktoré sú len možné, stále hľadáme nových prispievateľov. Ak máte záujem, prečítajte si sekciu <em>Začíname</em> nižšie.

source: Getting Started
sk: Začíname

source: Before you can contribute translations, you have to go through the steps below. Note that <em>ALL</em> these steps are required:
sk: Skôr ako budete chcieť prispieť prekladmi, musíte prejsť nasledujúcimi krokmi. Všimnite si, ktoré <em>VŠETKY< em> kroky sú vyžadované:

source: First go to the <a href="https://translations.xfce.org/accounts/register/">registration page</a> and create a new profile. After you've pressed the <em>Register</em>-button, you will receive an email to confirm your account, before you can login.
sk: Najprv choďte na <a href="https://translations.xfce.org/accounts/register/">registračnú stránku</a> a vytvorte nový profil. Potom, čo ste stlačili tlačidlo <em>Registrácie</em>, prv než sa budete môcť prihlásiť, dostanete e-mail pre potvrdenie vášho účtu.

source: After you've logged in, go to your <a href="https://translations.xfce.org/accounts/profile/edit/personal/">profile page</a> and set your <em>First name</em>, <em>Surname</em> and <em>Native Language</em>. Your complete name is <em>required</em> for submitting translations and will be used in the GIT logs, so take this seriously!
sk: Potom, čo ste sa prihlásili, prejdite do svojho <a href="https://translations.xfce.org/accounts/profile/edit/personal/">profilu</a> a nastavte svoje<em>Meno</em>, <em>Priezvisko </em> a <em>rodný jazyk</em>. Vaše celé meno je <em>potrebné</em> pre predkladanie prekladov a bude použité v GIT logoch, takže k tomu pristúpte seriózne!

source: Join the <a href="http://foo-projects.org/mailman/listinfo/xfce-i18n">Xfce translation mailing list</a>. This is where the translation communication is coordinated, so it is nice to introduce yourself here. On this list developer will also announce when releases are planned, translations system changes or anything else you should know as a translators.
sk: Pripojte sa do <a href="http://foo-projects.org/mailman/listinfo/xfce-i18n">e-mailovej konferencie Xfce prekladu</a>. To je miesto, kde je koordinovaná komunikácia, takže je dobré sa tu predstaviť. V tejto konferencii sa tiež oznámi, kedy je plánované vydanie, zmeny systémových prekladov, alebo niečo iné, čo by ste ako prekladatelia mali vedieť.

source: Go to the <a href="https://translations.xfce.org/projects/p/xfce/teams/">Xfce translation teams</a> and request access to a team or request a new language if it doesn't exist yet. One of the developers or translation coordinators will approve (or decline) your request. All other product in this Transifex installation outsource the permissions of the Xfce product, so your rights in this product will apply all over <a href="https://translations.xfce.org">translations.xfce.org</a>.
sk: Prejdite na <a href="https://translations.xfce.org/projects/p/xfce/teams/">tímy prekladov Xfce</a> a požiadate o prístup k tímu, alebo požiadať o nový jazyk, ak zatiaľ neexistuje. Jeden z vývojárov alebo koordinátorov prekladu schváli (alebo zamietne) Vašu žiadosť. Všetky ostatné časti v Transifex inštalácií zdieľajú oprávnenia Xfce, takže vaše práva budú platiť na celom <a href="https://translations.xfce.org">translations.xfce.org</a>.

source: Now wait patently. If it takes too long, leave a message on the translation mailing list.
sk: Počkajte, ak to trvá príliš dlho, zanechajte odkaz.

source: Once this has all happened, you should have permission to submit and update translations in your language. You can find more information about this below. Don't forget to keep in touch with the other translators in your language (you can find them in the translation groups) to coordinate the translation work!
sk: Akonáhle sa to všetko stalo, mali by ste mať oprávnenie na odoslanie a aktualizáciu prekladov vo vašom jazyku. Nižšie si môžete o tomto nájsť viac informácií. Nezabudnite byť v kontakte s ostatnými prekladateľmi vo svojom jazyku (nájdete ich v prekladateľských skupinách) pre koordináciu prekladateľskej práce!

source: If you think anything went wrong, ideas? Don't hesitate and send an email to the Xfce translation mailing list, we're always there to help you!
sk: Myslíte si že niečo nie je správne a máte nápady? Neváhajte a pošlite e-mail do mailing listu Xfce prekladu, sme Vám vždy k dispozícii!

source: Team Work
sk: Tímová práca

source: Keep in touch with the current translator(s). Is your language already translated or being translated by someone else, then you should try to work together with the current translator(s) of that language, and split up the work so you are reducing the workload and increasing the quality of the translation. Many translators are happy to share the work or even appreciate people discussing translations.
sk: Buďte v kontakte s aktuálnym prekladateľom/prekladateľmi. Ak je váš jazyk už preložený alebo ho prekladá niekto iný, potom by ste sa mali snažiť spolupracovať s aktuálnymi prekladateľmi, a rozdeliť prácu, tak že sa obmedzí pracovná záťaž a zvýši sa kvalita prekladu. Mnohí prekladatelia sa radi podelia o prácu alebo dokonca ocenia diskusie o prekladoch.

source: The header of the PO files contain the field &quot;Last-Translator&quot; As example here is the French translation of xfce4-panel: <a href="http://git.xfce.org/xfce/xfce4-panel/plain/po/fr.po">fr.po</a>.
sk: Hlavička súboru PO obsahuje pole &quot;Last-Translator&quot; Ako príklad je tu francúzsky preklad xfce4-panel: <a href="http://git.xfce.org/xfce/xfce4-panel/plain/PO/fr.po">fr.po</a>.

source: You can send an email to the i18n mailing-list as well with a copy (CC) to the current translator if you did find out his email. Let know your intention and wait for an answer from the current translator(s). If you don't get a response in the upcoming weeks (2~3 weeks) you can consider translating the different projects.
sk: Môžete poslať e-mail do i18n e-mail konferencie a spolu s kópiou (CC) pre aktuálneho prekladateľa, ak ste zistili jeho ​​e-mail. Nechajte poznať váš zámer, a čakajte na odpoveď od súčasného prekladateľa/prekladateľov. Ak sa nedostanete odpoveď v nasledujúcich týždňoch (2 ~ 3 týždne), môžete zvážiť prekladanie rôznych projektov.

source: Other than getting in touch with current translators, you can use a private page to share progress on translations. The defacto place is on <a href="http://wiki.xfce.org/translations/">wiki.xfce.org</a>, but you can also use alternative possibilities like the <a href="http://groups.google.com/support/">Google Groups</a>.
sk: Inak, než sa dostať do kontaktu s aktuálnymi prekladmi, môžete použiť stránky pre zdieľanie pokroku v prekladoch. Miesto je na <a href="http://wiki.xfce.org/translations/">wiki.xfce.org</a>, alebo môžete použiť aj alternatívne možnosti ako <a href="http://groups.google.com/support/ ">Google Skupiny</a>.

source: Team Coordinator
sk: Koordinátor tímu

source: Transifex allows you to manage a team with a list of translators and coordinators. Usually you will find one coordinator per team who is allowed to perform the following tasks:
sk: Transifex umožňuje spravovať tím a zoznam prekladateľov a koordinátorov. Obvykle nájdete v každom tíme jedného koordinátora, ktorý smie vykonávať nasledujúce úlohy:

source: Accept or deny new translators in the team
sk: Prijať alebo odmietnuť prekladateľa v tíme

source: Accept or deny a translation review
sk: Prijať alebo odmietnuť hodnotenie prekladu

source: The coordinator should not accept new translators without having a little history of their involvement in other projects. If it is unsure if a new member has deep knowledge of translations or not, it is possible to check the new Transifex account and start a short discussion per email. At this point the coordinator can either accept the new member who will be allowed to commit changes directly in our repositories, otherwise the coordinator can ask the new member to submit the work for review. This process is important whenever the translations have to use a standard vocabulary for instance.
sk: Koordinátor by nemal prijímať nových prekladateľov, bez toho aby mali nejakú skúsenosť z iných projektov. Ak ste si nie istý, či má nový člen hlboké znalosti z prekladania, alebo nemá, je možné to skontrolovať cez nový Transifex účet a začať krátkej diskusiu cez email. V tomto bode môže koordinátor buď prijať nového člena, ktorý bude môcť potvrdiť zmeny priamo v našich repozitároch, alebo môže vyzvať nového člena a ponúknuť mu prácu pre posudzovanie. Tento proces je dôležitý, pretože preklady musia používať štandardnú slovnú zásobu.

source: A good practice for the coordinator is to check the translations before a new release, that consists into compiling each Xfce component with the latest translations and making sure everything is in good shape.
sk: Dobrá prax pre koordinátora je kontrola prekladov pred novým vydaním, ktorá sa skladá zo zostavenia jednotlivých komponentov Xfce s najnovšími prekladmi a uistením sa, že je všetko v poriadku.

source: Transifex Usage
sk: Transifex použitie

source: Statistics
sk: Štatistiky

source: Transifex provides statistics per language and per project. The <a href="https://translations.xfce.org/projects/p/xfce/">Xfce collection project</a> view is the most interesting as it lets you know if the core projects are fully translated. An overview of the language stats in Xfce core master are <a href="https://translations.xfce.org/projects/p/xfce/r/master/">here</a>. It is also possible to get to such a page by going to the <a href="https://translations.xfce.org/languages/">language page</a> first and picking up your language than a collection. The collection &quot;Xfce&quot; has several components for the different stable versions (<em>xfce-4.4</em>, <em>xfce-4.6</em>, etc) and one for the development branch (<em>master</em>). The other collections, for example Applications, have usually only development components as they aren't part of any official Xfce releases.
sk: Transifex poskytuje štatistiky pre každý jazyk v každom projekte. Pohľad <a href="https://translations.xfce.org/projects/p/xfce/">kolekcie projektu Xfce</a> je najzaujímavejšie, ako môžete vedieť, keďže základné projekty sú plne preložené. Prehľad štatistiky jazyka v Xfce master sú <a href="https://translations.xfce.org/projects/p/xfce/r/master/">tu</a>. Je tiež možné sa dostať na tieto stránky tým, že pôjdete na <a href="https://translations.xfce.org/languages/">stránku jazyka</a>. Zbierka &quot;Xfce&quot; má niekoľko zložiek pre rôzne stabilná verzie (<em>xfce-4.4</em>, <em>xfce-4.6</em> atď.) a jeden pre vývojovú vetvu (<em>master</em>). Iné kolekcie, napríklad aplikácie, majú zvyčajne len vývoj komponentov, pokiaľ nie sú súčasťou nejakej oficiálnej verzie Xfce.

source: Downloading Translations
sk: Sťahovanie prekladov

source: You can visualize and download PO files from existing translations. For that just go to a project page or select a collection from the languages page, than click one of the small buttons at the right of the statistics. If there is no current translation you can download the source file (the PO template) available on each project page. Also when you are on a collection view you have at the bottom of the statistics table a download section with ZIP files.
sk: Môžete si zobraziť a stiahnuť PO súbory z existujúcich prekladov. Stačí ísť na stránku projektu alebo vyberte súbor zo stránky jazykov, potom kliknite na jedno z malých tlačidiel na pravej strane štatistík. Ak tam nie je aktuálny preklad môžete si stiahnuť zdrojový súbor (šablóna PO), ktorý je k dispozícii na každej stránke projektu. Keď ste na pohľadu zbierky, máte v spodnej časti tabuľky štatistík sekciu na stiahnutie ZIP súborov.

source: Uploading Translations
sk: Nahrávanie prekladov

source: When you are identified on Transifex and have the upload rights it is very simple to upload new translations. Go to a project and choose the component that corresponds to a stable version or to the development branch &mdash; you can pass through the collection page to find a project &mdash; then click on the small <em>Upload</em> button besides the visualize/download/lock/edit buttons at the right of your language or the <em>Add a new translation</em> button at the bottom of the page if it doesn't exist yet. Fill in the form and click the <em>Send</em> button.
sk: Ak ste identifikovaný na Transifex a máte nahrávacie práva je veľmi jednoduché nahratie nového prekladu. Prejdite k projektu a vyberte zložku, ktorá zodpovedá stabilnej verzii, alebo k vývojovej &mdash; môžete prejsť kolekciu, kde nájdete projekt &mdash; a potom kliknite na malé <em>Upload</em> tlačidlo vedľa visualize/download/lock/edit tlačidlá na pravej strane vášho jazyka, alebo <em>Add a new translation</em> tlačidlo v dolnej časti stránky, ak ešte neexistuje. Vyplňte formulár a kliknite na tlačidlo <em>Send</em>.

source: It is a good idea to click the <em>Lock</em> button when doing a translation while there is more than one active translator for your current language. Besides the <em>Upload</em> form, you can click the <em>Edit</em> button to update the translations online.
sk: Je to dobrý nápad, kliknite na <em>Lock</em>, keď robíte preklad, zatiaľ čo tam je viac ako jeden aktívny preklad pre aktuálny jazyk. Okrem <em>Upload</em> formy, môžete kliknúť na <em>Edit</em> tlačidlo a môžete aktualizovať preklady on-line.

source: Forums
sk: Fórum

source: Whether it be to solve a problem or to contribute in any way, the Xfce communities are a good place to get help or to share your ideas. You might also want to have a look at the communities of the different distributions which provide Xfce.
sk: Či už je to riešenie problému alebo prispievanie akýmkoľvek spôsobom, komunity Xfce sú dobrým miestom pre získanie pomoci, alebo podelenie sa o svoje nápady. Taktiež sa môžete pozrieť na komunity rôznych distribúcií, ktoré Xfce používajú.

source: Mailing lists
sk: Mailové konferencie

source: <strong>NOTE:</strong> In order to post to these lists, you must first subscribe.
sk: <strong>Poznámka:</strong> Pre príspevok z tohto zoznamu, sa musíte najskôr prihlásiť.

source: If you have a problem that you cannot resolve, you might want to try asking a question in our IRC channel <a href="irc://irc.freenode.net/#xfce">#xfce on irc.freenode.net</a>. The channel has several active users. It is recommended that you consult the <a href="http://docs.xfce.org/" class="external">documentation</a> about your problem before asking your question.
sk: Ak máte problém, ktorý nemôžete vyriešiť, môžete skúsiť položiť otázku na našom IRC kanály <a href="irc://irc.freenode.net/#xfce">#xfce na irc.freenode.net</a>. Kanál má niekoľko aktívnych používateľov. Skôr než položíte otázku, skúste tiež použiť <a href="http://docs.xfce.org/" class="external">dokumentáciu</a> na váš problém.

source: For users who prefer forums, the <a href="http://forum.xfce.org/" class="external">Xfce Forum</a> is the place to be. Active contributors will be able to help you, but please do not use it for bug reports.
sk: Pre používateľov, ktorí dávajú prednosť fóram, je miesto pre vás tu na <a href="http://forum.xfce.org/" class="external">Xfce Fóre</a>. Aktívny prispievatelia vám pomôžu, ale prosím, nepoužívajte fórum pre hlásenie chýb.
