Repository: Libertasio/www.xfce.org
Catalog: lib/po/*.po
Languages: sk

source: The preferred applications framework, which was previously only available in <b>Terminal</b>, was imported into Xfce, so users no longer need to edit shell profiles to specify which browser and terminal emulator should be used by Xfce applications. The goal was to make it as easy as possible to change an application for a certain category (GNOME users may have already noticed that GNOME adopted this approach, because it is such simple).
sk: Rámec preferovaných aplikácií, ktorý bol predtým k dispozícii len v <b>Terminále</b>, bol importovaný do Xfce, takže používatelia si už nebudú musieť upravovať shell profily pre určenie, ktoré prehliadač a emulátor terminálu by mal byť používaný Xfce aplikáciami. Cieľom bolo to spraviť čo najjednoduchšie ako je len možné (GNOME užívatelia si môžu všimnúť, že GNOME prevzalo tento prvok, pretože je jednoduchý).

source: And then there was the problem with the keyboard shortcuts in Xfce 4.2... Xfce 4.2 limited the number of freely available keyboard shortcuts, while people wanted to assign any number of keyboard shortcuts. With Xfce 4.4 this limitation is history and the application shortcuts are now separated from the window manager shortcuts.
sk: Ďalej bol v Xfce 4.2 problém s klávesovými skratkami... Xfce 4.2 obmedzoval počet voľne dostupných klávesových skratiek, zatiaľ čo si používatelia chceli priradiť ľubovoľné množstvo klávesových skratiek. S Xfce 4.4 je toto obmedzenie už len história a skratky aplikácií sú teraz oddelené od skratiek správcu okien.

source: Feedback
sk: Spätná väzba

source: Please post comments on this article in my <a href="http://xfce-diary.blogspot.com/2007/01/visual-tour-of-xfce-440.html">blog</a> and use the <a href="/community/lists">xfce</a> mailinglist if you have questions about Xfce 4.4.0 or trouble with the installation.
sk: Prosím, pošlite mi komentáre k tomuto článku na môj <a href="http://xfce-diary.blogspot.com/2007/01/visual-tour-of-xfce-440.html">blog</a> a použitie <a href="/community/lists">Xfce</a> e-mailovú konferenciu, ak máte otázky týkajúce sa Xfce 4.4.0, alebo problémy s inštaláciou.

source: A large number of people contributed to the Xfce project. Although more people contributed to the project then the ones list below, we'd like to say:
sk: Veľké množstvo ľudí prispelo k projektu Xfce. Aj keď na projekt prispelo viac ľudí ako je uvedených nižšie na zozname, radi by sme povedali:

source: Thanks to all who helped making this software available!
sk: Ďakujeme všetkým, ktorí pomohli aby bol tento softvér k dispozícii!

source: Core developers
sk: Hlavný vývojári

source: Active contributors
sk: Aktívni prispievatelia

source: Servers maintained by
sk: Servery vedené

source: Goodies supervision
sk: Dohľad Goodies

source: Translations supervision
sk: Dohľad prekladov

source: Translators
sk: Prekladatelia

source: Previous contributors
sk: Predchádzajúci prispievatelia

source: Xfce News
sk: Xfce Novinky

source: Xfce release announcements
sk: ohlásenie novej verzie Xfce

source: Best regards,<br />The Xfce development team
sk: S pozdravom,<br /> Xfce vývojársky tím

source: Xfce 4.8 released
sk: Xfce 4.8 uvoľnené

source: Today, after almost two years of work, we have the special pleasure of announcing the much awaited release of Xfce 4.8, the new stable version that supersedes Xfce 4.6.
sk: Dnes, po takmer dvoch rokoch práce, máme potešenie vám oznámiť vydanie veľa očakávanej verzie Xfce 4.8, nová stabilná verzia, ktorá nahrádza Xfce 4.6.

source: We hope that everyone will enjoy this release as much as we do. Sadly, this will not be the case as the folks using any of the BSD systems will notice a sudden loss of features. We think that this announcement is a good opportunity to express our disagreement with the recent "Linux-only" developments in the open source ecosystem, especially with regards to the utilities we need in desktop environments.
sk: Dúfame, že sa každému bude páčiť toto vydanie rovnako ako nám. Je smutné, že to nebude prípad ľudí ktorí používajú niektorú verziu z BSD systémov. Myslíme si, že toto oznámenie je dobrou príležitosťou, ako vyjadriť svoj ​​nesúhlas s nedávnym "Len-Linux" vývoj v open source ekosystéme, a to najmä s ohľadom na nástroje, ktoré potrebujeme v pracovnom prostredí.

source: Xfce 4.8 is our attempt to update the Xfce code base to all the new desktop frameworks that were introduced in the past few years. We hope that our efforts to drop pieces like ThunarVFS and HAL with GIO, udev, ConsoleKit and PolicyKit will help bringing the Xfce desktop to modern distributions.
sk: Xfce 4.8 je náš pokus o aktualizáciu Xfce kódu založeného pre všetky nové desktopové frameworky, ktoré boli zavedené v niekoľkých posledných rokoch. Dúfame, že naše úsilie o pokles kúskov, ako je ThunarVFS a HAL s GIO, udev, ConsoleKit a PolicyKit pomôže prinášať Xfce do moderných distribúcií.

source: With Xfce 4.8 our users will be able to browse remote shares using a variety of protocols (SFTP, SMB, FTP and many more). The window clutter has been reduced by merging all file progress dialogs into a single one.
sk: S Xfce 4.8 naši používatelia budú môcť prezerať vzdialené zdieľania pomocou rôznych protokolov (SFTP, SMB, FTP a mnoho ďalších). Zmätok okna bol znížený zlúčením všetkých dialógov postupu súborov do jedného.

source: Our panel application has been rewritten, thereby improving positioning, transparency, item and launcher management. It also introduces a new menu plugin to view directories. Its plugin framework remains compatible with 4.6 plugins.
sk: Náš panel aplikácií bol prepísaný, čo vedie k možnosti zmeny pozície, transparentnosti, manažmentu položiek a spúšťača. Zavádza aj nové menu modul pre prehliadanie adresárov. Je to modul framwork a je aj naďalej v súlade s 4.6 modulmi.

source: We also improved our settings dialogs. The display configuration dialog now supports RandR 1.2, detects screens automatically and allows our users to pick their favorite resolution, refresh rate, rotation. Screens can be configured to either work in clone mode or be placed next to each other. Keyboard selection has become easier and more user-friendly. Also, the manual settings editor has been updated to be more functional.
sk: Taktiež sme vylepšili možnosti nastavení. Nastavenie displeja teraz podporuje RandR 1.2, detekuje automaticky obrazovky a umožňuje používateľom si vybrať ich obľúbené rozlíšenie, obnovovaciu frekvenciu či otáčanie. Obrazovky môžu byť konfigurované buď pracovať v režime klonovania alebo môžu byť umiestnené vedľa seba. Nastavenie klávesnice je odteraz jednoduchšie a užívateľsky prívetivejšie. Tiež, ručné nastavenia editora bol aktualizovaný pre väčšiu funkčnosť.

source: Aside from the features implemented in Xfce, the 4.8 development cycle brought us a bunch of other goodies. For the first time we had a serious release strategy formed after the "Xfce Release and Development Model" developed at the Ubuntu Desktop Summit in May 2009. A new web application made release management a lot easier. We worked hard on improving the situation of Xfce translators which led us to setting up our own Transifex server. Something else you will hopefully notice is that our server and mirroring infrastructure has been improved so that our servers hopefully will not suddenly surrender shortly after this release announcement.
sk: Okrem funkcií implementovaných do Xfce, vývojový cyklus 4.8 nám priniesol veľa ďalších zaujímavostí. Prvýkrát sme mali vážnu stratégiu vydania po vzniku "Xfce modelu vydania a vývoja" rozvinutého na Ubuntu Desktop summite v máji 2009. Nová webová aplikácia riadi verzie oveľa jednoduchšie. Tvrdo sme pracovali na zlepšení situácie Xfce prekladov, ktoré nás viedli k založeniu vlastného Transifex servera. Snáď si všimnete, že náš server a zrkadlenie infraštruktúry bolo vylepšené, a dúfame, že sa nezrútia krátko po vydaní tohto oznámenia.

source: There is a lot more to discover and we hope a lot of you will give Xfce 4.8 a try! There is a brief tour online on
sk: Je tam veľa čoho objavovať a dúfame, že veľa z vás Xfce 4.8 vyskúša! Je tu aj krátka on-line ukážka

source: A summary of the changes since the 4.8pre3 preview release is available on the following URL (it also includes links to the changes introduced in all preview releases):
sk: Prehľad zmien od verzie 4.8pre3 je k dispozícii na nasledujúcej adrese (tiež obsahuje odkazy pre zmeny zavedené vo všetkých verziách):

source: The release can be downloaded either as individual releases or as a fat tarball including all these individual versions:
sk: Vydanie sa dá stiahnuť buď jednotlivo alebo ako balík zahŕňajúci všetky jednotlivé verzie:

source: 2011 has just begun and we are already planning for the future. The 4.10 schedule will be worked on soon and hopefully, we will be able to turn Xfce into a non-profit organization at this year's FOSDEM, so stay tuned!
sk: Rok 2011 práve začal a my už plánuje budúcnosť. Dúfame že plánovanie 4.10 bude spravené čoskoro, a budeme môcť otočiť Xfce na neziskovú organizáciu v tomto roku FOSDEM, takže zostaňte naladení!

source: But until then we hope you will enjoy today's release and join us in celebrating. Thanks go out to all our contributors, bug reporters as well as the awesome efforts of our translators and packagers.
sk: Ale do tej doby dúfame, že sa vám bude páčiť dnešné vydanie a pripojíte sa k nám s oslavovaním. Ďakujeme všetkým našim prispievateľom, nahlasovačom chýb a rovnako za úžasné úsilie našich prekladateľov a tvorcov balíčkov.

source: Today we are pleased to announce the third and hopefully final preview release of Xfce 4.8 which is set to be pushed out to the public on January 16th, 2011. Compared to Xfce 4.8pre2 this release mostly features translation updates and bug fixes.
sk: Dnes vám s potešením oznamujeme, že tretie a dúfame, že posledné vydanie verzie Xfce 4.8, bude vydané 16. januára 2011. V porovnaní s Xfce 4.8pre2 táto verzia obsahuje predovšetkým aktualizované preklady a opravy chýb.

source: With christmas and new year's eve between 4.8pre2 and 4.8pre3 it comes as no surprise that for most components only a few issues were tackled.
sk: Vo vianočnom a silvestrovskom predvečery medzi 4.8pre2 a 4.8pre3 nebude žiadnym prekvapením, že pre väčšinu komponentov sa vyrieši len niekoľko otázok.

source: Among other things we updated the default keyboard shortcuts to include monitor keys. The status icon of the file manager's progress dialog is now properly hidden when the dialog is destroyed. It's wallpaper plugin is now capable of handling filenames with spaces. The environment variables of commands launched from the Xfce run dialog were not set properly, so we fixed that so that commands launched from the dialog always inherit the environment of the Xfce session.
sk: Okrem iného sme aktualizovali predvolené klávesové skratky, aby zahŕňali monitorovacie klávesy. Status ikony správcu súborov postupového dialógu sa teraz správne ukryje, keď sa dialógové okno ukončí. Modul tapety je teraz schopný zvládnuť názvy súborov aj s medzerami. Premenné prostredia spúšťaných príkazov z Xfce spúšťal nesprávne nastavený dialóg, takže sme to opravili tak, že príkazy spustené z dialógu vždy zdedia prostredie Xfce sedenia.

source: We also made the --reboot and --halt parameters of xfce4-session-logout work again which previously simply logged out the active user. In order to avoid a race condition at session startup and in order to speed things up a little more we no longer use xrdb to update xft and cursor settings and instead, update the related XSETTINGS properties ourselves.
sk: Tiež sme spravili --reboot a --halt parametre xfce4-session-logout, ktoré predtým iba odhlásili aktívneho používateľa. Aby sa zabránilo sporom počas štartu sedenia a v snahe veci trochu urýchliť sa viac už nepoužije xrdb pre aktualizáciu xft a nastavenie kurzora ale namiesto toho sa aktualizujú súvisiace XSETTINGS vlastnosti samé.

source: In the window manager xfwm4, we aligned the time period required for a double click with that of normal applications. Via the hidden option /general/mousewheel_rollup one can now disable windows being rolled up via the mouse wheel. The window manager now also properly handles resolution changes in fullscreen windows like those appearing in games. Xfwm4's application switcher now only appears once in cloned mode.
sk: V správcovi okein xfwm4 sme pridali časové obdobie potrebné pre dvojklik. Pomocou skrytých možností /general/mousewheel_rollup možno teraz vypnúť scrolovanie pomocou kolieska myši. Správca okien teraz taktiež správne spracováva zmeny rozlíšenia obrazovky voči celoobrazovkovým oknám ktoré sú v hrách. Xfwm4 prepínač sa objaví len raz v klonovanom režime.

source: This may sound like a few useful fixes but it's nothing compared to the amount of work that went into the new Xfce panel once again. Around 20+ known bugs and regressions were fixed. Here is a short excerpt of the complete changelog: Translation domains were fixed for external plugins, plugins can be reordered with DND again, double-clicking items in the item editor shows their preferences, dragging items to the item editor dialog removes them from the panel again, tasklist windows can now be filtered by monitor. Another issue that appeared recently and has now been fixed is the icon sizing in the notification area, also known as the systray.
sk: Môže to znieť ako niekoľko užitočných opráv, ale nie je to nič v porovnaní s množstvom práce, ktorá išla znova do nového Xfce panela. Asi 20+ známych chýb a regresií bolo opravených. Tu je krátky výber z celej zmeny: Preklad domén bol opravený pre externé moduly, moduly môžu byť dodané s DND, dvojité poklepanie na položky v položke editora zobrazuje ich preferencie, presunutím položiek na položku editora ich dialóg opäť odstráni z panela, zoznam úloh je teraz možné filtrovať podľa zobrazenia. Ďalším problémom, ktorý sa objavil len nedávno a teraz už je opravený je zmena veľkosti ikony v oznamovacej oblasti, tiež známa ako systray.

source: Xfce 4.8pre3 also features a lot of translation updates, as can be seen in the complete changelog.
sk: Xfce 4.8pre3 tiež obsahuje veľké množstvo aktualizácií prekladov, ako je vidieť v kompletnom logu zmien.

source: Since we're following the Xfce <a href="/about/releasemodel">release model</a> for 4.8, we'd normally announce code freeze and the creation of early lifecycle support branches today. We decided against this because there are not enough people active to take care of all this at the moment. So we will continue fixing bugs in master branches as we did between 4.8pre2 and 4.8pre3.
sk: Vzhľadom k tomu, že u Xfce postupuje <a href="/about/releasemodel">model verzie</a> na 4.8, tak by sme za normálnych okolností mali oznámiť zmrazenie kódu a vytvorenie vetiev podpory životného cyklu. Rozhodli sme sa ale proti tomu, pretože na to nie je dostatok ľudí, ktorý by sa v túto chvíľu o to aktívne starali. Takže budeme pokračovať opravou chýb v hlavnej vetve, tak ako sme to urobili medzi 4.8pre2 a 4.8pre3.

source: We are pleased to announce the second preview release of Xfce 4.8. This release marks the beginning of the string freeze. From today on until the final release, strings may no longer be changed in the master branch of Xfce core components. This will help translators to prepare their translations for the final release scheduled on January 16th, 2011.
sk: Sme radi, že vám môžeme oznámiť vydanie druhej verzie Xfce 4.8. Táto tlačová správa označuje začiatok zmrazenia. Od dnešného dňa až do finálnej verzie, sa reťazce nedajú zmeniť v hlavej vetve základných Xfce komponentov. To pomôže prekladateľom pripraviť ich preklady pre finálne vydanie, ktoré je naplánované na 16. januára 2011.

source: For this release we focused on fixing bugs in all Xfce components. We managed to close a great number of them thanks to all the persons who reported them and tested proposed fixes quickly.
sk: V tomto vydaní sme sa zamerali na opravovanie chýb vo všetkých komponentoch Xfce. Podarilo sa nám veľké množstvo z nich opraviť a uzavrieť vďaka všetkým osobám, ktorí nahlasovali a rýchlo testovali navrhované opravy.

source: A few minor panel features were added despite feature freeze. We also managed to work on two long time requests: proper support for editing the application menu with menu editors (Alacarte being the one that we tested) and integration with the Compiz viewport. Of course, this release also features a lot of new and improved translations thanks to the amazing work of our translation teams.
sk: Niekoľko drobných funkcií panela bolo pridaných aj počas zmrazenia. Podarilo sa nám tiež popracovať na dvoch dlhodobých žiadostiach: podpora pre editáciu menu s aplikáciami editorom (Alacarte je ten, ktorý sme testovali) a integráciu s Compiz. Samozrejme, že táto verzia tiež obsahuje množstvo nových a vylepšených prekladov vďaka úžasnej práci našich prekladateľských tímov.

source: The Xfce development team is proud to announce the first preview release for Xfce 4.8. Together with this preview release, the Xfce project announces the feature freeze for the final 4.8 release which is set to be pushed out to the world on January 16th, 2011.
sk: Vývojový tím Xfce vám s potešením oznamuje prvé predbežné vydania Xfce 4.8. Spolu s touto predbežnú verziu, projekt Xfce vyhlasuje zmrazenie finálnej verzie 4.8, ktoré je stanovené pre vydanie do sveta na 16. január 2011.

source: This release incorporates major changes to the core of the Xfce desktop environment and hopefully succeeds in fulfilling a number of long time requests. Among the most notable updates is that we have ported the entire Xfce core (Thunar, xfdesktop and thunar-volman in particular) from ThunarVFS to GIO, bringing remote filesystems to the Xfce desktop. The panel has been rewritten from scratch and provides better launcher management and improved multi-head support. The list of new panel features is too long to mention in its entirety here. Thanks to the new menu library garcon (formerly known as libxfce4menu, but rewritten once again) we now support menu editing via a third-party menu editor such as Alacarte (we do not ship our own yet). Our core libraries have been streamlined a bit, a good example being the newly introduced libxfce4ui library which is meant to replace libxfcegui4.
sk: Táto tlačová správa obsahuje zásadné zmeny jadra pracovného prostredia Xfce a dúfame, že uspeje pri splnení dlhodobých žiadostí. Medzi najpozoruhodnejšiu aktualizáciu patrí prenesenie celého Xfce jadra (Thunar, xfdesktop a thunar-volman predovšetkým) z ThunarVFS na GIO, čím sme priniesli vzdialené súborové systémy do Xfce. Panel bol prepísaný od základov a poskytuje lepšie riadenia spúšťania a lepšie podporu multi-obrazoviek. Zoznam nových funkcií panelu je príliš dlhý na uvedenie jeho plného rozsahu. Vďaka novému menu garcon knižnice (predtým známa ako libxfce4menu, tiež bola znova celá prepísaná) teraz podporuje úpravy ponuky prostredníctvom editoru tretej strany ako Alacarte (zatiaľ nemáme vlastný). Naše základné knižnice boli trochu zjednodušené, dobrým príkladom je novo zavedená knižnica libxfce4ui, ktorá má za cieľ nahradiť libxfcegui4.

source: Perhaps the most important achievement we will accomplish with Xfce 4.8 is that, despite suffering from the small size of the development team from time to time, the core of the desktop environment has been aligned with today's desktop technologies such as GIO, ConsoleKit, PolicyKit, udev and many more. A lot of old cruft like has been stripped from the core as well, as has happened with HAL and ThunarVFS (which is still around for compatibility reasons).
sk: Pravdepodobne najdôležitejší úspech dosiahneme s Xfce 4.8, aj napriek tomu, že z času na čas trpí malou veľkosťou vývojového tímu, hlavná časť pracovné prostredia je v súlade s dnešnými desktop technológiami, ako sú GIO, ConsoleKit, PolicyKit, udev a mnoho ďalších. Mnoho starých bolo odstránených z jadra rovnako ako sa to stalo s HAL a ThunarVFS.

source: Thanks to the awesome Transifex translation platform, our language teams have been able to update their translations at an incredible pace. Please include them when praising this release!
sk: Vďaka úžasnej platforme prekladov Transifex, sú naše jazykové tímy schopné aktualizovať ich preklady neuveriteľným tempom. Prosím uveďte ich, ak bude chváliť túto verziu!

source: The second bugfix-release of xfce 4.6 has been released.
sk: Druhé vydanie Bugfix verzie 4.6 bolo vydané.

source: This release features a lot of updated translations and fixes some bugs or regressions with new GTK+ versions.
sk: Toto vydanie obsahuje mnoho aktuálnych prekladov a opravuje niektoré chyby a regresie s novými verziami GTK +.

source: The first bugfix-release of xfce 4.6 has been released.
sk: Boli vydané prvé opravy chýb verzie Xfce 4.6 .

source: Thanks to all the people who have been using xfce 4.6 and took the time and effort to submit bugreports for stuff that wasn't quite working the way it is supposed to. We have been able to fix several issues during the past few weeks.
sk: Ďakujeme všetkým ľuďom, ktorí používajú Xfce 4.6 a za ich čas a úsilie pri nahlasovaní chýb o komponentoch, ktoré nie celkom pracovali tak, ako mali. Boli sme schopní vyriešiť niekoľko problémov počas niekoľkých posledných týždňov.

source: thanks to all the translators, several translations have been improved and completed since the release of 4.6.0.
sk: vďaka všetkým prekladateľom, niekoľko prekladov bolo vylepšených a dokončených od vydania 4.6.0.

source: After more than two years of development, Xfce 4.6.0 has just been released.
sk: Po viac ako dvoch rokoch vývoja, bola práve uvoľnená Xfce 4.6.0 .

source: Xfce 4.6 features a new configuration backend, a new settings manager, a brand new sound mixer, and several huge improvements to the session manager and the rest of Xfce's core components. A list of all the changes since the last release candidate can be found on this page.
sk: Xfce 4.6 obsahuje nový konfiguračné rozhranie, nového správcu nastavení, nový zvukový mixér, a niekoľko obrovských vylepšení v správcovi sedenia a zvyšku základných časti Xfce. Zoznam všetkých zmien od posledného kandidáta vydania možno nájsť na tejto stránke.

source: A visual overview of Xfce 4.6 is available <a href="/about/tour46">here</a>.
sk: Vizuálny prehľad Xfce 4.6 je k dispozícii <a href="/about/tour46">tu</a>.

source: Translation
sk: Preklad

source: Welcome to the Xfce community. By joining our team, you will be part of an international effort by hundreds of people working to deliver a stunning Free Software computing experience. You will meet new friends, learn new skills and make a difference to millions of users while working with people from all around the globe. There are many different ways you can become part of this, just read on and pick an area which interests you or seems challenging.
sk: Vitajte v komunite Xfce. Pripojením sa k nášmu tímu, budete súčasťou medzinárodného úsilia stoviek ľudí, ktorí pracujú, aby vám poskytli úžasný otvorený softvér. Stretnete nových priateľov, naučíte sa novým zručnostiam a bude to mať význam pre milióny používateľov pri práci s ľuďmi z celého sveta. Existuje mnoho rôznych spôsobov, ako sa môžete stať súčasťou tohto projektu, stačí iba čítať ďalej a vybrať si oblasť, ktorá vás zaujíma, alebo je pre vás výzvou.

source: Possible tasks include testing, bug reporting; writing code, developing artwork, documentation or translations; or spreading the word and helping out with promotion and marketing both on line and at tradeshows and conferences.
sk: Možné úlohy zahŕňa testovanie, hlásenie chýb, písanie kódu, tvorba kresieb, dokumentácie a prekladov alebo šírenie s propagáciou či marketing ako na internete tak aj na veľtrhoch a konferenciách.

source: Documentation
sk: Dokumentácia

source: Development
sk: Vývoj
