Repository: Libertasio/www.xfce.org
Catalog: lib/po/*.po
Languages: sk

source: As usual, <b>Xfwm4</b> has matured quite a bit during this release cycle: many bugs have been fixed, support for multiple displays has been added, and overall performance has been improved.
sk: Ako obvykle, <b>Xfwm4</b> v tomto vývojovom cykle už dozrel: veľa chýb bolo opravených, bola pridaná podpora pre viac monitorov, a bol celkovo zlepšený výkon.

source: In addition to some other new features, <b>Xfwm4</b> is now able to detect windows that do not respond and offer to terminate them.
sk: Okrem toho niektoré ďalšie nové funkcie, <b>Xfwm4</b> je teraz schopný detekovať okná, ktoré neodpovedajú a ponúka ich ukončenie.

source: Dialog to terminate busy applications
sk: Dialógové okno o ukončení zaneprázdnených aplikácií

source: There is also a new <b>actions menu</b> which allows you to quickly move and resize windows, put them above or below other windows, or fullscreen them.
sk: K dispozícii je tiež nové <b>menu akcií </b>, ktoré umožňuje rýchlo presúvať a meniť veľkosť okien, dať ich pod alebo nad ostatnými okná, alebo je nastaviť celo-obrazový režim.

source: New actions menu
sk: Nové menu akcií

source: A new <b>fill</b> operation has been implemented; it expands a given window to the available space without overlapping other adjacent windows.
sk: Bolo implementované nové <b>vyplňovanie</b>. To rozpína ​​dané okno, aby voľného miesta bez prekrývania ďalších priľahlých okien.

source: Fill operation
sk: Vyplnenie

source: The <b>compositor</b> has been optimized to reduce window flickering duringresize operations.
sk: <b>Skladateľ</b> bol optimalizovaný pre zníženie blikanie okna počas zmeny veľkosti.

source: Flicker free resizing
sk: Obraz bez zmeny veľkosti

source: Some <b>tweakable options</b> have also been added: for example, you can now disable the blinking of windows when they receive an urgency hint.
sk: Niektoré <b>efektné voľby</b> boli doplnené o to, že môžete teraz vypnúť blikanie okna, keď dostane príznak naliehavosti.

source: New tweakable options
sk: Nové možnosti tweakable

source: There have been many bug fixes and performance improvements in <b>Thunar</b>. It can use the mouse forward and backward buttons (if available) to navigate, and it includes a new plugin that allows you to set an image as wallpaper from the context menu.
sk: V <b>Thunare</b> bolo opravených veľa chýb a vylepšenia výkonu. Je možné pomocou myši tlačidlami dopredu a dozadu (ak sú k dispozícii) navigovať a obsahuje nový modul, ktorý umožňuje nastaviť obrázok ako tapetu z kontextovej ponuky.

source: <b>Thunar</b> now follows the <a href="http://freedesktop.org/wiki/Software/xdg-user-dirs"> XDG user directories</a> specification; this allows you to have themed and localized user folders to store your music, documents, videos, templates, etcetera...
sk: <b>Thunar</b> teraz nasleduje <a href="http://freedesktop.org/wiki/Software/xdg-user-dirs">XDG používateľske adresáre</a>, čo umožňuje mať tematické a lokalizované užívateľské zložky pre ukladanie hudby, dokumentov, videa, šablóny a tak ďalej ...

source: Thunar menu for user directories
sk: Thunar menu pre používateľské adresáre

source: <b>Thunar</b> will now display a translucent icon for drives or volumes that are not mounted, so that you can distinguish them from the mounted ones.
sk: <b>Thunar</b> teraz zobrazí priesvitné ikony pre disky alebo zväzky, ktoré nie sú namontované, takže je možné ich odlíšiť od tých primontovaných.

source: Translucent icons for unmounted drives and volumes
sk: Priesvitné ikony pre nepripojené disky a oddiely

source: Last, but not least, <b>Thunar</b> now supports encrypted devices!
sk: V neposlednom rade <b>Thunar</b> teraz podporuje šifrované zariadenia!

source: Thunar support for encrypted devices
sk: Podpora Thunaru pre šifrované zariadenia

source: Xfce 4.6 features a new settings interface, <b>Xfce Settings Manager</b>, which allows you to configure your desktop environment much more easily than before. The dialogs which are accessible by single clicking on the icons have been designed to be more compact and to allow you to customize your desktop quickly and in a more intuitive way.
sk: Xfce 4.6 obsahuje nové rozhranie nastavovania, <b>Xfce Správca nastavení</b>, ktorý umožňuje konfigurovať pracovné prostredie oveľa ľahšie ako predtým. Dialógy, ktoré sú dostupné prostredníctvom jediného kliknutia na ikonu boli navrhnuté tak, aby boli kompaktnejšie a umožňovali prispôsobiť pracovnú plochu rýchlo a viac intuitívnym spôsobom.

source: Xfce4 Settings Manager
sk: Xfce4 Správca Nastavení

source: Accessibility settings
sk: Nastavenia prístupnosti

source: Accessibility settings dialog
sk: Dialógové okno nastavení prístupnosti

source: The <b>Accessibility settings</b> dialog allows you to set the accessibility related mouse and keyboard options, such as sticky keys, bounce keys, or mouse emulation.
sk: <b>Nastavenia prístupnosti</b> umožňuje nastaviť sprístupnenie, možnosti myši a klávesnice, ako napríklad prstom, odskok kláves, alebo emulácia myši.

source: Appearance settings
sk: Nastavenia vzhľadu

source: Appearance settings dialog
sk: Dialógové okno nastavení vzhľadu

source: The <b>Appearance settings</b> dialog allows you to set the widget style, the icon theme, and font, toolbar and menu options.
sk: <b>Nastavenie vzhľadu</b> umožňuje nastaviť štýl ovládacieho prvkov, ikon a písma, ovládací panel a menu.

source: Display settings
sk: Nastavenia zobrazenia

source: Display settings dialog
sk: Dialógové okno nastavení zobrazenia

source: The <b>Display settings</b> dialog allows you to set the resolution, refresh rate, and the rotation for each screen that is connected.
sk: <b>Nastavenie displeja</b> umožňuje nastaviť rozlíšenie, obnovovaciu frekvenciu a rotáciu pre každý displej, ktorý je pripojený.

source: Keyboard settings
sk: Nastavenia klávesnice

source: Keyboard settings dialog, layout tab
sk: Dialógové okno nastavení klávesnice, rozloženia

source: The <b>Keyboard settings</b> dialog allows you to set keyboard preferences such as key repeating, keyboard shortcuts, and your keyboard layout.
sk: <b>Nastavenie klávesnice</b> umožňuje nastaviť predvoľby klávesnice ako opakovanie sa klávesy, klávesové skratky a rozloženie klávesnice.

source: Keyboard settings dialog, shortcuts tab
sk: Dialógové okno nastavení klávesnice, klávesových skratiek

source: You can now configure shortcuts more simply, and any shortcut conflicts are automatically detected.
sk: Teraz môžete nastaviť klávesové skratky jednoduchšie a všetky miestne konflikty sú automaticky detekované.

source: Mouse settings
sk: Nastavenia myši

source: Mouse settings dialog
sk: Dialógové okno nastavení myši

source: The <b>Mouse settings</b> dialog allows you to configure the different mice connected to your computer: button order, acceleration, double-click speed, mouse cursor theme, etcetera...
sk: <b>Nastavenie myši</b> umožňuje nastaviť rôzne myši pripojené k počítaču: tlačidlo, zrýchlenie, rýchlosť poklepanie, témy kurzoru myši a tak ďalej...

source: Desktop settings
sk: Nastavenia plochy

source: Desktop settings dialog
sk: Dialógové okno nastavení plochy

source: The <b>Desktop settings</b> dialog is now much more compact; it allows you to configure per-screen settings: wallpaper, brightness, desktop menu, displayed icons, etcetera...
sk: <b>Nastavenie plochy</b> je teraz oveľa kompaktnejšie, umožňuje nastaviť: tapetu, jas, menu plochy, zobrazenie ikon a podobne...

source: <b>Xfce 4.6</b> also comes with a brand new application finder which features a cleaner user interface. It is also easier to use it with the keyboard, and it monitors installed applications to update the list "on the fly." It also allows you to create panel launchers quickly by dragging an application icon to the launcher creation window.
sk: <b>Xfce 4.6</b> tiež prichádza s úplne novou aplikáciou Finder, ktorá ponúka čistejšie používateľské rozhranie. Je ľahšie ovládateľná s použitím klávesnice, sleduje nainštalované aplikácie pre aktualizáciu "za letu." Tiež umožňuje rýchlo vytvoriť spúšťací panel presunutím ikony aplikácie.

source: New application finder
sk: Nový vyhľadávač aplikácie

source: Links
sk: Odkazy

source: Xfce website
sk: Xfce web stránky

source: Thunar website
sk: Thunar web stránky

source: Written by Jérôme Guelfucci (February 2009)
sk: Napísal Jérôme Guelfucci (Február 2009)

source: Screenshots by Jannis Pohlmann
sk: Ukážky od Jannis Pohlmann

source: Xfce 4.4 tour
sk: Xfce 4.4 prehliadka

source: As of today, the long awaited version 4.4.0 of the Xfce Desktop Environment is finally available. I will try to highlight some of the new features which have been added since the last stable release.
sk: K dnešnému dňu je dlho očakávaná verzia 4.4.0 pre prostredie Xfce konečne k dispozícii. Pokúsime sa vám poukázať niektoré z nových funkcií, ktoré boli pridané od poslednej stabilnej verzie.

source: Desktop Icons
sk: Desktopové ikony

source: One of the most often requested features during the 4.0 and 4.2 was support for icons on the desktop. Now, with Xfce 4.4.0, this feature was finally added to the desktop manager <b>Xfdesktop</b>.
sk: Jedna z najčastejšie požadovaných funkcií v 4.0 a 4.2 bola podpora ikon na ploche. Teraz v Xfce 4.4.0 bola táto funkcia konečne pridaná do manažéra plochy <b>Xfdesktop</b>.

source: The desktop manager utilizes <b>Thunar</b>'s libraries to handle application launchers and regular files/folders on the desktop. The desktop manager is also able to display icons for minimized windows on the desktop, which is quite a popular feature from the CDE world. Of course, you can disable the desktop icons altogether if you prefer a clean desktop.
sk: Manažér plochy využíva <b>Thunar</b> knižnice na ovládanie spúšťaču aplikácií a bežných súborov/zložiek na ploche. Manažér plochy je tiež schopný zobraziť ikony pre minimalizované okná na ploche, čo je veľmi obľúbená funkcia z CDE sveta. Samozrejme, ikony na ploche môžete vypnúť ak dávate prednosť čistej ploche.

source: <b>Xfdesktop</b> also continues to provide access to the applications menu, as it did in the previous Xfce releases.
sk: <b>Xfdesktop</b> i naďalej poskytuje prístup k menu aplikáciám, rovnako ako v predchádzajúcich verziách Xfce.

source: The desktop icon support goes hand in hand with the new file manager <a href="http://thunar.xfce.org/">Thunar</a> which replaces the previous file manager <b>Xffm</b>.
sk: Ikony na ploche idú ruka v ruke s novým správcom súborov <a href="http://thunar.xfce.org/">Thunar</a>, ktorý nahradil predchádzajúceho správcu súborov <b>Xffm</b>.

source: <b>Thunar</b> was written from scratch to provide an easy to use, but still very lightweight file manager for Xfce. Its user interface was designed to look similar to the file chooser which was introduced with GTK+ 2.4, and other file managers such as <b>Nautilus</b> and <b>pcmanfm</b> already picked up that idea as well.
sk: <b>Thunar</b> bol od začiatku napísaný pre jednoduché použitie, a stále ako veľmi ľahký správca súborov pre Xfce. Jeho používateľské rozhranie je navrhnuté tak, aby sa podobalo výberu súborov, ktoré boli zavedené s GTK+ 2.4 a ostatnými správcami súborov, ako sú <b>Nautilus</b> a <b>pcmanfm</b>.

source: <b>Thunar</b> supports all the file management functionality which users will expect, and also several advanced features. For example, a so-called <i>Bulk Renamer</i> is included which allows users to rename multiple files at once using a certain criterion.
sk: <b>Thunar</b> podporuje všetky funkcie pre správu súborov, ktoré používatelia očakávajú, a tiež niekoľko pokročilých funkcií. Napríklad tzv <i>hromadné premenovanie</i>, ktoré umožňuje používateľom premenovanie viacerých súborov naraz pomocou určitého kritéria.

source: Removable Drives and Media
sk: Vymeniteľné jednotky a média

source: Xfce 4.4.0 provides easy access to data on removable drives and media. Just insert the media into the drive or plug the new drive in to the computer and an icon representing the removable volume will appear on the desktop and in <b>Thunar</b>'s side pane.
sk: Xfce 4.4.0 poskytuje jednoduchý prístup k dátam na vymeniteľných jednotkách a médiách. Stačí vložiť médium do mechaniky alebo pripojiť nový disk do počítača a ikona reprezentujúca oddiel sa objaví na ploche a v bočnom paneli <b>Thunaru</b>.

source: Click on the icon to automatically mount the volume. Right-click the icon to unmount the drive or eject the media from the drive. Note however that this feature requires <a href="http://freedesktop.org/wiki/Software_2fhal">HAL</a> and is therefore only available for Linux 2.6.x and FreeBSD 6.x and above at the time of this writing (there is limited removable media support for FreeBSD 4.x and 5.x which does not require HAL).
sk: Kliknite na ikonu automaticky pripojiť zväzok. Kliknutím pravým tlačidlom myši na ikonu odpojíte disk alebo vysunutie médium z mechaniky. Všimnite si však, že táto funkcia vyžaduje <a href="http://freedesktop.org/wiki/Software_2fhal">HAL</a>, je teda k dispozícii len pre Linux 2.6.x a FreeBSD 6.x alebo vyššie (je tam obmedzená podpora pre vymeniteľné média - FreeBSD 4.X a 5.x ktoré nevyžadujú HAL).

source: Text Editor
sk: Textový editor

source: The new text editor <b>MousePad</b> is included with this release. <b>MousePad</b> provides all the basic editor functionality, nothing more, nothing less.
sk: Nový textový editor <b>MousePad</b> je súčasťou tejto verzie. <b>MousePad</b> poskytuje všetky základné funkcie editora, nič viac, nič menej.

source: You can think of <b>MousePad</b> as the equivalent to <b>NotePad</b> on Windows. It starts up very fast, usually in less than one second, even on older systems.
sk: Môžete si myslieť že <b>MousePad</b> je ekvivalent k <b>Poznámkovému blok</b> vo Windows. Štartuje veľmi rýchlo, zvyčajne menej ako jednu sekundu, a to aj na starších systémoch.

source: <b>Xfwm4</b> continues to be the window manager of the hearts.
sk: <b>Xfwm4</b> je i naďalej správcom okien.

source: This release features an enhanced compositor, supporting transparent ARGB windows, shadows, window frame transparency and much more.
sk: Táto verzia ponúka vylepšené skladateľ, podporuje transparentné ARGB okná, tiene, transparentné okenné rámy a mnoho ďalšieho.

source: <b>Xfwm4</b> also includes a brand new application switcher, as shown in the screenshot above, which displays all windows from the current workspace with icons and window titles.
sk: <b>Xfwm4</b> obsahuje aj úplne novú prepínaciu aplikáciu, ako je znázornené na obrázku vyššie, ktorý zobrazí ikony a názvy všetkých okien z aktuálnej pracovnú plochy.

source: Further on support for multiple image formats for window decoration themes was added, including <tt>PNG</tt>, <tt>GIF</tt> and <tt>SVG</tt> images.
sk: Ďalej bola pridaná podpora viacerých obrazových formátov pre témy dekorácie okna, vrátane <tt>PNG</tt>, <tt>GIF</tt> a <tt>SVG</tt> obrázky.

source: Advanced controls for the window manager were also added, allowing thorough tweaking of window behavior.
sk: Boli tiež pridané rozšírené ovládacie prvky pre správcu okien, umožňuje dôkladné ladenie správania sa okna.

source: The <b>Xfce4-panel</b> was completely rewritten for the Xfce 4.4 release. Multiple panels are supported <i>out of the box</i> now and can easily be configured using the new <b>Panel Manager</b> shown in the screenshot below.
sk: <b>Xfce4-panel</b> bol kompletne prepísaný pre verziu Xfce 4.4. Viacnásobné panely sú podporované i <i>mimo boxu</i> a možno ich ľahko konfigurovať pomocou nového <b>Panel manažéra</b>, čo je znázornené na nasledujúcom obrázku.

source: One of the major problems in previous Xfce releases was that every plugin had to be run in the same process as the panel, and hence every plugin was able to crash the whole panel. To address this issue, support for external plugins was added to the panel.
sk: Jedným z hlavných problémov predchádzajúcich verzií Xfce bolo, že každý modul musel byť spustený v rovnakom procese ako panel, a teda každý plugin bol schopný zhodiť celý panel. Pre vyriešenie tohto problému, bola pridaná podpora pre externé pluginy do panelu.

source: Developers of panel plugins can now decide whether the plugin should run as external process or as part of the panel process, depending on the stability of the plugin.
sk: Vývojári modulov do panel sa teraz môžu rozhodnúť, či modul by mal bežať ako externý proces alebo ako súčasť procesu panelu, v závislosti na stabilite modulu.

source: Since there is now support for multiple panels, the separate <b>Xftaskbar4</b> and <b>Xfce4-iconbox</b> utilities are no longer required. Instead, both the taskbar and the iconbox are available as panel plugins now.
sk: Vzhľadom k tomu, že teraz už je podpora pre viacnásobné panely, oddelené <b>Xftaskbar4</b> a <b>xfce4-iconbox</b> utility už nie sú potrebné. Namiesto týchto je teraz k dispozícii panel modulov.

source: Most of the additional panel plugins, available via the <a href="http://goodies.xfce.org/">Xfce Goodies Project</a>, have been updated for the new panel, and several new plugins were added. For example, the brand new <b>xfce4-xfapplet-plugin</b> allows users to add GNOME panel applets to the Xfce panel.
sk: Väčšina ďalších modulov, je k dispozícii cez <a href="http://goodies.xfce.org/">Xfce projekt Goodies</a>, kde sú aktualizované a je pridaných niekoľko nových modulov. Napríklad nový <b>xfce4-xfapplet-plugin</b> umožňuje používateľom pridávať GNOME applety do panela Xfce.

source: Time Management
sk: Správca času

source: The new time management application <b>Orage</b> replaces the <b>Xfcalendar</b>, which was introduced with Xfce 4.2.0. <b>Orage</b> provides several features to efficiently manage your time.
sk: Nová aplikácia pre správu času <b>Orage</b> nahradená <b>Xfcalendar</b>, ktorá bola predstavená s Xfce 4.2.0. <b>Orage</b> ponúka niekoľko funkcií, ktoré efektívne riadi Váš čas.

source: While <b>Orage</b> is very lightweight and easy to use, it supports all the important features found in larger calendar applications like <b>Outlook</b> or <b>Evolution</b>. While <b>Xfcalendar</b> used the custom <tt>dbh</tt> format in the past to store your settings, <b>Orage</b> is based on <tt>ical</tt> and therefore compatible with other calendar applications.
sk: Napriek tomu, že <b>Orage</b> je veľmi jednoduchý a ľahko sa používa, podporuje všetky dôležité vlastnosti z väčších kalendárov ako <b>Outlook</b> alebo <b>Evolution</b>. <b>Xfcalendar</b> používal v minulosti vlastný <tt>dbh</tt> formát pre uloženie nastavení, <b>Orage</b> je založený na <tt>ical</tt>, a preto kompatibilný s ostatnými kalendármi.

source: Terminal Emulator
sk: Emulátor terminálu

source: While <b>Terminal</b> was already available during the 4.2 days, it was not mature enough at that time to be part of the core. With this major release, it was moved into the core desktop.
sk: Aj keď bol <b>Terminál</b> už k dispozícii počas 4.2, nebolo dostatočne vyladený. V tejto hlavnej verzii, to bol presunutý do jadra prostredia.

source: Besides the basic features which you might expect from a terminal emulator, it includes some nice additional features, like multiple tabs per window, customizable toolbars and the ability to configure nearly every aspect of the application via <i>hidden options</i>. As can be seen in the screenshot above, this release also supports real transparency using <b>Xfwm4</b>'s integrated composition manager.
sk: Okrem základných funkcií, ktoré by ste mohli očakávať od emulátora terminálu, obsahuje aj nejaké ďalšie funkcie, ako napríklad viac záložiek v okne, prispôsobiteľný panel nástrojov a možnosť nastaviť takmer všetky aspekty aplikácie pomocou <i>skrytých možností</i>. Ako je vidieť na obrázku vyššie, táto verzia tiež podporuje skutočnú transparentnosť s použitím <b>Xfwm4</b> integrovaným manažérom zloženia.

source: Printing
sk: Tlač

source: <b>Xfprint</b>, the Xfce printing management application, saw several small improvements with this release. First, the <tt>a2ps</tt> converter is not mandatory anymore, whilst still recommended. Support for <tt>CUPS</tt> 1.2 was added and <b>Xfprint</b> is now able to display the printer state with the <tt>CUPS</tt>-backend.
sk: <b>Xfprint</b>, Xfce manažment tlače, dostal niekoľko drobných vylepšení. Po prvé, <tt>a2ps</ tt> prevodník už nie je povinný, zatiaľ stále doporučený. Bola pridaná podpora pre <tt>CUPS</tt> 1.2 a <b>Xfprint</b> je teraz schopný zobraziť stav tlačiarne s <tt>CUPS</tt> rozhraním.

source: <b>Xfprint</b> also integrates with <b>MousePad</b> to provide generic printing support for different kinds of text documents using the <tt>a2ps</tt> converter.
sk: <b>Xfprint</b> je tiež integrovaný s <b>MousePad</b> pre podporu tlače rôznych typov textových dokumentov pomocou <tt>a2ps</tt> prevodníka.

source: As you can see the print dialog still looks relatively similar to that of Xfce 4.2, but the internal workings of the printing support were improved, especially the <tt>CUPS</tt> support. Besides that, the printing management functionality was moved to a library, so other applications can use the API to access the printer configuration.
sk: Ako môžete vidieť dialógové okno tlače stále vyzerá relatívne podobný tomu v Xfce 4.2, ale vnútorné fungovanie podpory tlače bolo vylepšené, a to najmä v <tt>CUPS</tt> podpore. Okrem toho, že správa funkcií pre tlač bola presunutá do knižnice, ostatné aplikácie môžu používať API pre prístup ku konfigurácii tlačiarne.

source: Xfce 4.4.0 implements the new <a href="http://freedesktop.org/wiki/Standards_2fautostart_2dspec">Autostart Specification</a> - actually Xfce was the first desktop to implement said feature, but the others were faster to release. ;-)
sk: Xfce 4.4.0 implementuje nové <a href="http://freedesktop.org/wiki/Standards_2fautostart_2dspec">Autoštart špecifikácie</a> - Xfce bolo v skutočnosti prvé prostredie, ktoré implementovalo túto funkciu, ale ostatní boli rýchlejší vo vydaní. ;-)

source: The specification consists of two parts, the <i>Autostart of Applications During Startup</i>, which is implemented in <b>xfce4-session</b> and the <i>Autostart Of Applications After Mount</i> which is implemented in <a href="http://foo-projects.org/~benny/projects/thunar-volman/index.html">thunar-volman</a>. This release also includes the <b>xfce4-autostart-editor</b>, shown in the screenshot above, which allows users to easily add, remove or disable autostarted applications.
sk: Špecifikácie sa skladá z dvoch častí, <i>Autoštart aplikácií počas spustenia</i>, ktorý je realizovaný v <b>xfce4-session</b> a <i>Autoštart aplikácií po pripojení</i>, ktorý je implementovaný v <a href="http://foo-projects.org/~benny/projects/thunar-volman/index.html">thunar-volman</a>. Táto verzia taktiež obsahuje <b>xfce4-autostart-editor</b>, zobrazený vyššie, ktorý umožňuje používateľom jednoducho pridať, odobrať alebo zakázať automatické spustenie aplikácií.

source: This release introduces new options to customize the desktop to your needs. Some examples of new settings dialogs were already shown in the sections above.
sk: Toto vydanie prináša nové možnosti prispôsobenia pracovnej plochy vašim potrebám. Niektoré príklady nových možností nastavenia sú už uvedené vo vyššie uvedených častiach.
